{"pages":[{"title":"CoderDojo 大府について","text":"CoderDojo大府は子供達がプログラミングを楽しむ場を提供する無料のコミュニティです。 愛知県大府市で開催します。 CoderDojo大府は 大体7歳〜17歳向けのプログラミング道場です。（年齢は絶対ではありません）プログラミングをしたい子供のために、自由にプログラミングをする環境を提供します。いわゆる習い事・塾ではないので、 費用は不要です。カリキュラムなどはなく、子供が作りたいと思ったものを尊重します。子供は仲間やメンター（指導者）と一緒に実現する方法を考えて取り組みます。子供・家族の理解を促進するために保護者が同席することを、とても推奨します。 CoderDojoについてCoderDojo Japanより引用 CoderDojo は7〜17歳の子どもを対象にしたプログラミング道場です。2011年にアイルランドで始まり、世界では110カ国・2,000の道場、日本では全国に200以上の道場があります。 （2020年2月現在)","link":"/about/index.html"},{"title":"アクセス","text":"","link":"/access/index.html"}],"posts":[{"title":"第１回開催レポート　2020/06/14","text":"6月14日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオンが集まりCoderDojo大府を（祝）初開催しました。 開催風景プログラミングが初めてのニンジャには、初級者向けのテキストを配布し、保護者の方と一緒にプログラミングソフト（Scratch）の操作方法を習得しました。また別の道場で修行を積んできたニンジャ２名は、ロールプレイングゲームを作成できるプログラミングソフト（HackforPlay）にて、プログラミングしました。 作品発表２匹の猫から逃げるねずみ最初は、男の子の１年生ニンジャです。マウスを動かして猫から逃げるゲームです。配布したテキストでは猫が１匹でしたが、２匹に増やして遊べるようになっていました。逃げ切るのが、なかなか難しそうです^^「むずかしかったところは？」の質問にも大きな声で堂々と答えることができました。 リンゴを食べる犬二人目は、女の子の１年生ニンジャです。マウスで犬を動かしてりんごを食べるゲームで、犬がリンゴにふれているあいだ点数が加算されていく仕組みになっていました。他のニンジャから「制限時間があった方が良いのでは？」という意見がありました。色んな意見を参考にプログラム改造に挑戦してみると、更に楽しいゲームになりそうです。 ドラクエっぽい見た目で敵を倒して進んでいくゲーム三人目は、男の子の5年生ニンジャです。HackforPlayを使って、ドラクエっぽい感じでキャラクターを操作し、出現する敵を倒してんでいくゲームです。みんな興味津々で画面を覗き込んでいました。 ドラクエっぽい見た目で様々な武器を装備し敵を倒すゲーム四人目は、男の子の3年生ニンジャです。先程と同じHackforPlayを使ってゲームを作成してくれました。作ったゲームの内容を分かりやすく丁寧に発表してくれて、他のニンジャに伝わったと思います。魔法の攻撃とか見た目もカッコよかったです。 手裏剣を投げる忍者五人目は、女の子の2年生ニンジャです。上下左右で忍者を動かし、スペースキーで手裏剣を投げるゲームです。テキストの漢字を読むのに苦戦したようだけど、忍者の動きはバッチリでした。 2匹の猫から逃げるねずみ六人目は、男の子の1年生ニンジャです。タブレットてねずみをドラッグ操作して猫から逃げるゲームです。ねずみの絵が顔と身体で分離していたので、皆の質問はゲーム内容ではなく分離している謎に集中！！楽しい発表になりました。 海のスポーツをしている猫七人目は、男の子の1年生ニンジャです。海のスポーツをしている猫を作ってくれました。パソコンをまともに触るのも初めてだったみたいだけど、猫を青く色塗りしたり、自分の名前のサインを入れてみたり、きれいな絵が仕上がっていました！ 忍者vsこうもり八人目は、男の子の3年生ニンジャです。忍者を操作してランダムに出現するこうもりを撃退していくゲームです。こうもりを倒したら点数が増えていき、こうもりに当たったらゲームオーバーになります。発表も堂々としていてとても良かったです。 全体を通して初開催でしたが、8人もの忍者が集まってくれて、皆楽しそうにプログラミングや発表に取り組んでくれて良いスタートが切れたと感じています。次回開催以降もニンジャが作りたい作品を作って発表するというスタイルで続けていき、それぞれのニンジャに前向きな変化を与えられるようなコミュニティであり続けられるよう切磋琢磨していけたらと考えています。 またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/06/19/2020-06-14%20%E7%AC%AC%EF%BC%91%E5%9B%9E/"},{"title":"第２回開催レポート　2020/06/28","text":"6月28日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター3人、チャンピオンが集まりCoderDojo大府を第2回を開催しました。 開催風景プログラミングが初めてのニンジャは初級者向けのテキストでscratchの操作に慣れてもらい、２回目以降のニンジャは好きな忍者の里カード(CoderDojo市川真間さんの公開テキスト)を選んでプログラミング、ベテランニンジャは個々で考えてきた作品をプログラミングしました。ベテランニンジャが１年生ニンジャに教える光景が多く見られました^^ 作品発表フライングネコアタック最初は、男の子の１年生ニンジャです。マウスで猫を動かして星に触れたら点数が増えていくゲームです。制限時間経過または紫(毒)の星に触れたらゲームオーバーになる仕組みになっており完成度が高い仕上がりになっていました。 ゴキブリをつかまえろ！二人目は、女の子の１年生ニンジャです。ランダムに出現するゴキブリをマウスでクリックすると点数が加算され、制限時間に達したら終了するゲームです。配布テキストはゴキブリを動かすサンプルプログラムのみでしたが、点数加算や制限時間の要素を追加でプログラミングし、皆で競える楽しいゲームになっていました。 スーパースロット三人目は、男の子の４年生ニンジャです。ボタンを押して各スロットを止めて絵柄が揃った数に応じて点数が加算されるゲームです。スロットを遊ぶためのチケットがクラウド変数になっていて、スロットを回すたびにチケットを消費し、消費したチケットが翌日に復活するという仕組みになっており、発想が斬新で面白かったです。スロットゲームとして高いレベルで仕上がっていました。 1日で作ったゲーム四人目は、男の子の３年生ニンジャです。先程同様スロットゲームです。シャッフルさせている画像は、自分で画面キャプチャしたものを使用しており、小学校３年生にしてパソコンを相当使いこなしています。スロットゲームもバッチリ遊べるよう動作していました。 おにごっこ五人目は、男の子の１年生ニンジャです。パソコン操作に不慣れの中、猫やダイバーが自動で画面内を動き続けるようプログラミングしました。猫の顔がお洒落に色塗りされており、かわいい作品に仕上がっていました。 忍者vsこうもり六人目は、男の子の中学２年生ニンジャです。ランダムで出現するコウモリを、忍者を操作して手裏剣で倒していくゲームです。初めてのプログラミングでしたがバグもなくサクッと作品を仕上げてくれました。 ねこがサッカーするゲーム七人目は、男の子の１年生ニンジャです。２匹の猫がそれぞれ相手のゴールに向かってボールを蹴り進めていく二人用のゲームです。相手ゴールにボールを入れた時にネコが喋るように作り込まれており、対戦ゲームとしてしっかり仕上がっていました。 全体を通して子供達同士がプログラミングを教えあうコミュニティにしていきたいと考えていたので、その光景を見ることが出来て非常に嬉しかったです。作品発表や質問タイムも皆が元気よく取り組み、保護者の方も含めて楽しめたのではないかと思います。 またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,900円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/06/29/2020-06-28%20%E7%AC%AC%EF%BC%92%E5%9B%9E/"}],"tags":[],"categories":[]}