{"pages":[{"title":"アクセス","text":"","link":"/access/index.html"},{"title":"CoderDojo 大府について","text":"CoderDojo大府は子供達がプログラミングを楽しむ場を提供する無料のコミュニティです。 愛知県大府市で開催します。 CoderDojo大府は 大体7歳〜17歳向けのプログラミング道場です。（年齢は絶対ではありません）プログラミングをしたい子供のために、自由にプログラミングをする環境を提供します。いわゆる習い事・塾ではないので、 費用は不要です。カリキュラムなどはなく、子供が作りたいと思ったものを尊重します。子供は仲間やメンター（指導者）と一緒に実現する方法を考えて取り組みます。子供・家族の理解を促進するために保護者が同席することを、とても推奨します。 CoderDojoについてCoderDojo Japanより引用 CoderDojo は7〜17歳の子どもを対象にしたプログラミング道場です。2011年にアイルランドで始まり、世界では110カ国・2,000の道場、日本では全国に200以上の道場があります。 （2020年2月現在)","link":"/about/index.html"}],"posts":[{"title":"第３回開催レポート　2020/07/05","text":"7月5日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター3人、チャンピオンが集まりCoderDojo大府第３回を開催しました。 開催風景好きな忍者の里カード(CoderDojo市川真間さんの公開テキスト)を選んでプログラミングしたり、個々で考えてきたゲームを作ったり、各ニンジャが自分の好きな作品を作りました。１年生ニンジャがローマ字表を見ながらキャラクターがしゃべるようプログラミングしている光景がチラホラ見られました。中にはローマ字表を使わずローマ字入力しているニンジャもいました。 作品発表ジャンプでよけろ！最初は、女の子の１年生ニンジャです。スペースキーで猫をジャンプさせてボールをかわしたら点数が増えていくゲームです。プレイ中に音を鳴らしたりゲームオーバーになったら猫の顔が変化したり細かな部分までプログラミングされていました。 ふたりでバトル！二人目は、男の子の５年生ニンジャです。ふたり用の対戦ゲームです。キャラクターごとに必殺技の攻撃力や見た目も違っており、実際にふたりで熱いバトルをしながら発表しました！！ 1日で作ったゲーム三人目は、男の子の３年生ニンジャです。マウスを動かして星にふれるとクリア、猫にふれると負けとなるゲームです。「クリア」や「失敗」時の音が、録音された自分の声が再生されるようプログラミングされておりアイデアが面白かったです。 動物のきょうそう四人目は、初めてscratchでゲーム作りに挑戦した男の子の１年生ニンジャです。猫とドラゴンとグリフォンが競争するゲームです。各動物がゴールを目指して自動で走り出すようプログラミングされていて各動物の走る速さも調整されており、楽しい作品に仕上がっていました。 ねこがふっとばされるゲーム五人目は、男の子の１年生ニンジャです。矢印キーで猫を操作し、バットを振り回す女の子をさけながらゴールを目指すゲームです。女の子がバットを振り回して見えるよう画像がコロコロ切り替わるようプログラミングされており、たたかれると本当に痛そうでした。（難易度は高めでバットにたたかれまくりました^^） どうぶつにあたるな六人目は、男の子の１年生ニンジャです。サメをマウスで操作して動き回るどうぶつを制限時間が0になるまで逃げ続けるゲームです。動物にふれたときや、制限時間逃げ切ったときに、猫が「まけ」「かち」等しゃべるようプログラミングされており、楽しめるゲームに仕上がっていました。 全体を通して保護者の方が寄り添って、ニンジャ達と一緒に考えながら進めている光景が多く見られました。作品発表では各ニンジャが自信をもって自分の作品を発表しており、保護者の方も楽しめたのではと思います。 またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/07/06/2020-07-05%20%E7%AC%AC%EF%BC%93%E5%9B%9E/"},{"title":"第２回開催レポート　2020/06/28","text":"6月28日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター3人、チャンピオンが集まりCoderDojo大府を第2回を開催しました。 開催風景プログラミングが初めてのニンジャは初級者向けのテキストでscratchの操作に慣れてもらい、２回目以降のニンジャは好きな忍者の里カード(CoderDojo市川真間さんの公開テキスト)を選んでプログラミング、ベテランニンジャは個々で考えてきた作品をプログラミングしました。ベテランニンジャが１年生ニンジャに教える光景が多く見られました^^ 作品発表フライングネコアタック最初は、男の子の１年生ニンジャです。マウスで猫を動かして星に触れたら点数が増えていくゲームです。制限時間経過または紫(毒)の星に触れたらゲームオーバーになる仕組みになっており完成度が高い仕上がりになっていました。 ゴキブリをつかまえろ！二人目は、女の子の１年生ニンジャです。ランダムに出現するゴキブリをマウスでクリックすると点数が加算され、制限時間に達したら終了するゲームです。配布テキストはゴキブリを動かすサンプルプログラムのみでしたが、点数加算や制限時間の要素を追加でプログラミングし、皆で競える楽しいゲームになっていました。 スーパースロット三人目は、男の子の４年生ニンジャです。ボタンを押して各スロットを止めて絵柄が揃った数に応じて点数が加算されるゲームです。スロットを回すたびにチケットを消費し、消費したチケットが翌日に復活するという仕組みになっており、発想が斬新で面白かったです。スロットゲームとして高いレベルで仕上がっていました。 1日で作ったゲーム四人目は、男の子の３年生ニンジャです。先程同様スロットゲームです。シャッフルさせている画像は、自分で画面キャプチャしたものを使用しており、小学校３年生にしてパソコンを相当使いこなしています。スロットゲームもバッチリ遊べるよう動作していました。 おにごっこ五人目は、男の子の１年生ニンジャです。パソコン操作に不慣れの中、猫やダイバーが自動で画面内を動き続けるようプログラミングしました。猫の顔がお洒落に色塗りされており、かわいい作品に仕上がっていました。 忍者vsこうもり六人目は、男の子の中学２年生ニンジャです。ランダムで出現するコウモリを、忍者を操作して手裏剣で倒していくゲームです。初めてのプログラミングでしたがバグもなくサクッと作品を仕上げてくれました。 ねこがサッカーするゲーム七人目は、男の子の１年生ニンジャです。２匹の猫がそれぞれ相手のゴールに向かってボールを蹴り進めていく二人用のゲームです。相手ゴールにボールを入れた時にネコが喋るように作り込まれており、対戦ゲームとしてしっかり仕上がっていました。 全体を通して子供達同士がプログラミングを教えあうコミュニティにしていきたいと考えていたので、その光景を見ることが出来て非常に嬉しかったです。作品発表や質問タイムも皆が元気よく取り組み、保護者の方も含めて楽しめたのではないかと思います。 またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,900円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/06/29/2020-06-28%20%E7%AC%AC%EF%BC%92%E5%9B%9E/"},{"title":"知多メディアスでCoderDojo大府が紹介されました","text":"知多エリアのニュース番組でCoderDojo大府第２回（2020/06/28）の様子が紹介されました。道場の雰囲気等も伝わるかと思いますので是非ご視聴ください！！ CoderDojo大府紹介動画","link":"/2020/07/07/2020-07-02%20%E7%9F%A5%E5%A4%9A%E3%83%A1%E3%83%87%E3%82%A3%E3%82%A2%E3%82%B9%E3%81%A7CoderDojo%E5%A4%A7%E5%BA%9C%E3%81%8C%E7%B4%B9%E4%BB%8B%E3%81%95%E3%82%8C%E3%81%BE%E3%81%97%E3%81%9F/"},{"title":"第５回開催レポート　2020/08/09","text":"8月9日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター2人、チャンピオンが集まりCoderDojo大府第５回を開催しました。 開催風景scratchやMinecraftを使用してゲーム作成を行いました。作品サンプル集（CoderDojo市川真間さんの公開テキスト)を選んでプログラミングしたり、個々で考えてきたゲームを作ったり、各ニンジャが自分の好きな作品を作りました。 作品発表トランポリンと自動ドア最初は、女の子の１年生ニンジャです。CoderDojo大府初のMinecraftによる作品発表です。ボタンを押すことで作動するトランポリン（爆発で飛ぶ）と自動ドア装置です。命令（ボタン押下、床に乗る）したら動作するようプログラミグされており、トランポリンのぶっ飛びもおもしろく、楽しめる作品になっていました。 ねこがふっとばされるゲーム二人目は、男の子の１年生ニンジャです。バットを振り回す女の子をかわしてゴールを目指すゲームです。女の子に触れた時、ゴールに着いた時、猫が喋るようプログラミングされており、スリルが楽しめるゲームに仕上がっていました。 ジャンプでよけろ三人目は、男の子の３年生ニンジャです。猫を操作してボールをジャンプでよけることで点数が加算されるゲームです。ジャンプ動作もキレイにプログラミングされており、高得点目指して何度もやってしまいそうなゲームでした。 ジュラシックワールドさいきょうボス四人目は、男の子の１年生ニンジャです。小さい恐竜が大きい恐竜に触れると食べられてしまう作品です。小さい恐竜の種類も多く見た目もキレイで、動作としてもバッチリ仕上がって（小さい恐竜が食べられまくって）いました。 すすめ！トリ クエスト五人目は、男の子の４年生ニンジャです。物語あり、アクションあり、キャラクター育成ありの、大ボリュームな作品です。メインとなるアクションゲームの難易度も絶妙で非常に楽しめそうでした。継続してメンテナンスされている作品とのことで、完成が待ち遠しいです。 カメラ六人目は、男の子の３年生ニンジャです。scratchのカメラ機能を利用して自分をリアルタイムで投影し、かつカメラで動きを検知すると画面上のカニが回転するプログラムでした。動きを検知するプログラムの発表は初めて見た人がほとんどであったため、皆「すげー」を連発し、発表を楽しめました。 全体を通して初めてのMinecraft作品やscratchでの動作検知プログラム等、作品を作る側も見る側も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/08/11/2020-08-09%20%E7%AC%AC%EF%BC%95%E5%9B%9E/"},{"title":"第４回開催レポート　2020/07/19","text":"7月19日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター1人、チャンピオンが集まりCoderDojo大府第４回を開催しました。 開催風景scratchを使用してゲーム作成を行いました。作品サンプル集（CoderDojo市川真間さんの公開テキスト)を選んでプログラミングしたり、個々で考えてきたゲームを作ったり、各ニンジャが自分の好きな作品を作りました。 作品発表まとあて最初は、男の子の１年生ニンジャです。左右に動くロケットのミサイルをタイミングよく発射して的に当てるゲームです。発表時点ではロケット動作とミサイル発射までプログラミング出来ていました。完成作品が楽しみです。 りんごキャッチ二人目は、女の子の１年生ニンジャです。ランダムに落ちてくるリンゴを皿でキャッチして点数が増えていくゲームです。制限時間もプログラミングされていて競い合えるゲームに仕上がっていました。 戦車三人目は、男の子の３年生ニンジャです。二人で遊べる戦車の対戦ゲームです。キーボードのボタンで戦車を左右回転や前進させつつ、砲撃等を実施して相手のライフを先にゼロにしたら勝ちです。発表では対戦を実演してもらいました。 ホッケー四人目は、男の子の３年生ニンジャです。二人で遊べるゲームセンターにあるようなエアホッケーゲームです。ボールの跳ね返りの動作だけでなく、点数、制限時間もプログラミングされており、ゲームとしての完成度が高かったです。 迷路五人目は、男の子の１年生ニンジャです。猫を操作して青いボールのゴールを目指す迷路を作成しました。発表時点では猫を動かすためのプログラミング途中でした。完成作品が楽しみです。 どくにあたるな六人目は、男の子の１年生ニンジャです。ダイバーを操作してサメから逃げつつ海の生き物をゲットするゲームです。ゲームのアイデアも面白く見た目もキレイで楽しめるゲームに仕上がっていました。 ねこがサッカーするゲーム七人目は、男の子の１年生ニンジャです。二人で遊べるサッカーゲームです。サッカーをしている後ろで、女の子がバットを振り回し続けている（応援？）ユニークなゲームでした。 全体を通して子供達からプログラミングに関する質問が多かったですが３年生の男の子がニンジャ兼メンターとして活躍してくれたおかげで、円滑にすすめることが出来ました。また保護者の方がニンジャ達と一緒に考えながら進めている光景が多く見られました。作品発表では各ニンジャが自信をもって自分の作品を発表しており、保護者の方も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,950円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/07/20/2020-07-19%20%E7%AC%AC%EF%BC%94%E5%9B%9E/"},{"title":"第７回開催レポート　2020/09/06","text":"9月6日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、メンター1人、チャンピオンが集まりCoderDojo大府第7回を開催しました。 開催風景Scratchによる作品作り5人、Minecraft（以下、マイクラ）による作品作り４人です。初参加のニンジャは4人で、Scratchを体験してもらいました。保護者の方もScratch習得に前向きでしたので、ニンジャ達も楽しみながら作品作りに取り組んでいる印象を受けました。 作品発表キャンプハウス最初は、男の子の１年生ニンジャによるマイクラ作品です。キャンプファイヤーや本棚やソファがバランスよく配置されている立派な家を作成しました。松明も丁寧に規則的に設置されており、作品に性格が出ていました。 動物園とキャンプとアヒルボート二人目は、女の子の１年生ニンジャによるマイクラ作品です。動物の種類毎に檻が用意されており、それぞれの檻には動物の名前が書かれた看板が用意されていました。看板作成はローマ字表を見ながらタイピングを頑張っていました。 未来の学校三人目は、男の子の３年生ニンジャによるマイクラ作品です。学校の外に、服や靴を自動で装着できる仕掛けや、動物小屋、釣堀を作成しました。トロッコを利用して簡単に移動できるような工夫もされていました。 超巨大な滝とガラスタワーと超巨大な図書館四人目は、男の子の１年生ニンジャによるマイクラ作品です。天空のガラスタワーから流れ落ちる滝を作成しました。滝の水が流れる先には本棚が山のようにあり、発想が面白い作品でした。 スロットマシン五人目は、男の子の４年生ニンジャによるScratch作品です。画面上に2個のさいころを配置し、スペースキーを押したらさいころの数がシャッフルされ、40回転したら自動停止する仕組みです。Scratchは、ほぼ初めてということでしたが遊べるゲームをしっかり仕上げてくれました。 ねこがぎゅうにゅう六人目は、男の子の１年生ニンジャによるScratch作品です。猫を十字キーで操作して牛乳に触れたらゴールです。１年生で既にXY座標を理解しながらプログラミングしていました。 たこたいりょう七人目は、男の子の２年生ニンジャによるScratch作品です。開始直後に様々なコスチュームのタコを画面上にバラバラと表示する作品を作ってくれました。マウス操作に慣れていない感じでしたが、お父さんと協力して楽しい作品に仕上げてくれました。 リズムゲーム八人目は、女の子の４年生ニンジャによるScratch作品です。リズムに合わせてボタンを押すゲームを途中まで作成してくれました。保護者の方と集中して作品制作に取り組んでくれました。 sea adventure九人目は、男の子の３年生ニンジャによるScratch作品です。作品は途中までですが、猫のコスチューム連続で切り替えて、歩いているよう見えるプログラムを作成してくれました。完成作品が楽しみです。 全体を通してマイクラ人気が上昇中です。個性的な建築物や仕掛けが新鮮で楽しいです。ニンジャ達はScratchもマイクラも操作を覚えるのが早く、個性的な作品をどんどん作るため、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/09/08/2020-09-06%20%E7%AC%AC%EF%BC%97%E5%9B%9E/"},{"title":"第９回開催レポート　2020/10/11","text":"10月11日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター1人、チャンピオンが集まりCoderDojo大府第9回を開催しました。 開催風景Scratchによる作品作り2人、Minecraft（以下、マイクラ）による作品作り4人です。初参加の幼稚園ニンジャには、Scratchを体験してもらいました。 作品発表競争最初は、男の子の２年生ニンジャによるScratch作品です。スペースキーで猫を動かして競争するゲームです。ゴール判定方法についての質問も的確に回答してくれました。 ドラゴン二人目は、男の子の幼稚園年長ニンジャによるScratch作品です。マウスクリックで猫をジャンプさせてドラゴンの火攻撃をかわすゲームです。Scratch楽しかったみたいなので次回作品も期待できそうです。 迷路と花火が出る家三人目は、女の子の１年生ニンジャによるマイクラ作品です。複数の花火を自動で打ち上げるレッドストーン回路を作ってくれました。発表中の作品にマルチプレイで参加して、みんなで迷路対決＆打ち上げ花火で、ワイワイ楽しい発表になりました。 電車の学校四人目は、男の子の１年生ニンジャによるマイクラ作品です。金ピカの学校を横切るような線路を建築してくれました。初めてのマイクラのようでしたがトロッコの使い方を習得し披露してくれました。 キャンプ場と洞窟と水に囲まれたガラス遺跡五人目は、男の子の１年生ニンジャによるマイクラ作品です。キャンプ場は檻に囲まれたパンダやにわとりの動物広場があり楽しそうでした。洞窟内の迷路も細かく作り込まれており、発表を重ねる毎にどんどんマイクラ建築レベルが向上していると感じました。 透明ガラスの家と紫ガラスの水族館六人目は、女の子の幼稚園年中ニンジャによるマイクラ作品です。紫ガラスの水族館は熱帯魚がいっぱいで見た目もキレイでした。途中、ガラスが割れて魚が逃げ出すハプニングもありましたが、発表中に補修する技術も見せてくれました。 全体を通してマイクラもScratchもニンジャ達が楽しんで作品作りに取り組んでいました。マイクラ製作のメンバーも増えてきて建築レベルも上達しているので次回くらいにマイクラのプログラミングを披露しようかと考えています。発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/10/15/2020-10-11%20%E7%AC%AC%EF%BC%99%E5%9B%9E/"},{"title":"第６回開催レポート　2020/08/23","text":"8月23日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター1人、チャンピオンが集まりCoderDojo大府第６回を開催しました。 開催風景Scratchによる作品作り３名、Minecraftによる作品作り３名です。Minecraft人気が高まってきました。 作品発表ゾンビを倒せ最初は、男の子の１年生ニンジャによるMinecraft作品です。檻（おり）の中に発生するゾンビを倒すゲームです。今日初めてMinecraftをプレイしたとのことでしたが、マウス、キーボードを巧みに使いこなし、あっさりゾンビを倒してくれました。 ジェットコースターと自動ドア二人目は、女の子の１年生ニンジャによるMinecraft作品です。トロッコと線路を使ってジェットコースターを作成しました。途中でトンネルも用意されており見てる側も楽しめました。自動ドアの仕掛けも問題なく動作していました。 未来の学校三人目は、男の子の３年生ニンジャによるMinecraft作品です。学校内の入り口、各教室はすべて自動ドアになっており、エンチャント室（装備を強化する部屋）やトイレや音楽室を作成してくれました。質問ではMinecraftの看板種類や特徴をわかりやすく説明してくれて勉強になりました。 スペースシューティング四人目は、男の子の３年生ニンジャによるScratch作品です。左右に動き回る敵にレーザを当てるゲームです。敵が左右に動く速度で乱数を使用しており不規則な動きとなるよう工夫されていました。 スロットマシン五人目は、男の子の１年生ニンジャによるScratch作品です。画面上に12個のさいころを配置し、スペースキーを押したらさいころの数がシャッフルされ、30回転したら自動停止する仕組みです。どの数が何個出現したかカウントして個数を画面表示しており、色々な楽しみ方が出来そうなゲームでした。 どん六人目は、男の子の５年生ニンジャによるScratch作品です。右から左に流れてくる赤丸や青丸を、太鼓の位置でタイミングよくボタンを押していくゲームです。点数機能を追加していく予定とのことで、更に楽しいゲームになりそうです。 全体を通してMinecraftによる作品発表が増えてきて、新鮮さもあり楽しいです。Scratch作品も、それぞれ子供達独自の工夫が見られて、見ていた側も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/08/23/2020-08-23%20%E7%AC%AC%EF%BC%96%E5%9B%9E/"},{"title":"第１回開催レポート　2020/06/14","text":"6月14日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオンが集まりCoderDojo大府を（祝）初開催しました。 開催風景プログラミングが初めてのニンジャには、初級者向けのテキストを配布し、保護者の方と一緒にプログラミングソフト（Scratch）の操作方法を習得しました。また別の道場で修行を積んできたニンジャ２名は、ロールプレイングゲームを作成できるプログラミングソフト（HackforPlay）にて、プログラミングしました。 作品発表２匹の猫から逃げるねずみ最初は、男の子の１年生ニンジャです。マウスを動かして猫から逃げるゲームです。配布したテキストでは猫が１匹でしたが、２匹に増やして遊べるようになっていました。逃げ切るのが、なかなか難しそうです^^「むずかしかったところは？」の質問にも大きな声で堂々と答えることができました。 リンゴを食べる犬二人目は、女の子の１年生ニンジャです。マウスで犬を動かしてりんごを食べるゲームで、犬がリンゴにふれているあいだ点数が加算されていく仕組みになっていました。他のニンジャから「制限時間があった方が良いのでは？」という意見がありました。色んな意見を参考にプログラム改造に挑戦してみると、更に楽しいゲームになりそうです。 ドラクエっぽい見た目で敵を倒して進んでいくゲーム三人目は、男の子の5年生ニンジャです。HackforPlayを使って、ドラクエっぽい感じでキャラクターを操作し、出現する敵を倒してんでいくゲームです。みんな興味津々で画面を覗き込んでいました。 ドラクエっぽい見た目で様々な武器を装備し敵を倒すゲーム四人目は、男の子の3年生ニンジャです。先程と同じHackforPlayを使ってゲームを作成してくれました。作ったゲームの内容を分かりやすく丁寧に発表してくれて、他のニンジャに伝わったと思います。魔法の攻撃とか見た目もカッコよかったです。 手裏剣を投げる忍者五人目は、女の子の2年生ニンジャです。上下左右で忍者を動かし、スペースキーで手裏剣を投げるゲームです。テキストの漢字を読むのに苦戦したようだけど、忍者の動きはバッチリでした。 2匹の猫から逃げるねずみ六人目は、男の子の1年生ニンジャです。タブレットてねずみをドラッグ操作して猫から逃げるゲームです。ねずみの絵が顔と身体で分離していたので、皆の質問はゲーム内容ではなく分離している謎に集中！！楽しい発表になりました。 海のスポーツをしている猫七人目は、男の子の1年生ニンジャです。海のスポーツをしている猫を作ってくれました。パソコンをまともに触るのも初めてだったみたいだけど、猫を青く色塗りしたり、自分の名前のサインを入れてみたり、きれいな絵が仕上がっていました！ 忍者vsこうもり八人目は、男の子の3年生ニンジャです。忍者を操作してランダムに出現するこうもりを撃退していくゲームです。こうもりを倒したら点数が増えていき、こうもりに当たったらゲームオーバーになります。発表も堂々としていてとても良かったです。 全体を通して初開催でしたが、8人もの忍者が集まってくれて、皆楽しそうにプログラミングや発表に取り組んでくれて良いスタートが切れたと感じています。次回開催以降もニンジャが作りたい作品を作って発表するというスタイルで続けていき、それぞれのニンジャに前向きな変化を与えられるようなコミュニティであり続けられるよう切磋琢磨していけたらと考えています。 またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/06/19/2020-06-14%20%E7%AC%AC%EF%BC%91%E5%9B%9E/"},{"title":"第１０回開催レポート　2020/10/25","text":"10月25日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、チャンピオンが集まりCoderDojo大府第10回を開催しました。 開催風景Scratchによる作品作り3人、Minecraft（以下、マイクラ）による作品作り4人です。初参加の小学生ニンジャ2名には、Scratchを体験してもらいました。 作品発表かぼちゃの山最初は、男の子の６年生ニンジャによるScratch作品です。上から落ちてくるかぼちゃを積み上げていくゲームです。左右移動の処理は完成していないものの、見た目もお洒落で、とても面白そうでしたので完成品が楽しみです。 バッタ二人目は、男の子の４年生ニンジャによるScratch作品です。バッタを操作して迫ってくるボールをジャンプでかわすゲームです。点数やジャンプの仕組みがむずかしかったとのこと。今後も色々な作品つくりに挑戦してもらいたいです。 ドラゴンキャッチ三人目は、男の子の２年生ニンジャによるScratch作品です。ドラゴンを操作してりんごを食べるゲームです。初めてのScratch作品かつタブレットでのプログラミングで難しい部分はありましたが、しっかり遊べるゲームに仕上げてくれました。 スキーの学校四人目は、男の子の１年生ニンジャによるマイクラ作品です。金ピカの学校の中にトロッコが走るレールが作成されており、トロッコが壁に反射して動き続ける仕組みを作成してくれました。他の１年生ニンジャもトロッコ仕掛けに興味津々でした。 お馬の家と家五人目は、女の子の幼稚園年中ニンジャによるマイクラ作品です。馬の家と大きな家を建築しました。大きな家がモンスターに占領されているハプニングがありましたが、発表中に無事退治してくれました。 滝と家と秘密基地と動物小屋六人目は、女の子の１年生ニンジャによるマイクラ作品です。ガラス張りの壁から滝が見えるような家を建築しました。滝が地面に到達してから広がらないように壁で囲むよう工夫されていました。 キャンプ場の改造七人目は、男の子の１年生ニンジャによるマイクラ作品です。作成済みのキャンプ場に展望台やホテルルームや立入禁止部屋（花火ルーム）を追加建築しました。ユニークな質問や回答が飛び交い面白い発表になりました。 全体を通してマイクラもScratchもニンジャ達が楽しんで作品作りに取り組んでいました。６年生ニンジャが子供メンターとして初参加ニンジャをしっかりフォローしてくれたおかげで、全体の進行も円滑にすすめることができました。発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。今回、自分がマイクラのプログラミングを披露しようと画策していたのですが、プログラミングで実現しようとしていた内容（自動で線路作成や家を建築）にニンジャ達が興味を持ってくれず（涙）断念しました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,400円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/10/27/2020-10-25%20%E7%AC%AC%EF%BC%91%EF%BC%90%E5%9B%9E/"},{"title":"第１４回開催レポート　2020/12/26","text":"12月26日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター1人、チャンピオンが集まりCoderDojo大府第14回を開催しました。 開催風景Scratchによる作品作り1人、Minecraft（以下、マイクラ）による作品作り5人です。 作品発表横スクロール基礎最初は、男の子の１年生ニンジャによるScratch作品です。左右キーを押すと猫の足が動作しつつ背景が左右スクロールする仕組みを作成しました。上キーによる猫ジャンプも実装されており、すぐにでもスーパーマリオのようなゲームが作れそうでした。 保健室と図書室二人目は、男の子の６年生ニンジャによるマイクラ作品です。保健室のカーテンを複数の旗を設置して表現しており素晴らしい出来栄えでした。図書室のカウンターや休憩スペースも美しい仕上がりでした。 秘密の地下室三人目は、男の子の３年生ニンジャによるマイクラ作品です。村の中に地下室を建築しました。出入するためのハシゴをジグザグに設置する工夫を見せてくれました。 おうちとプール四人目は、女の子の幼稚園年中ニンジャによるマイクラ作品です。紫のガラスで出来た家とプールを建築しました。家の中には椅子を設置してプールは水族館のようにする予定とのことです。 クリスマスと家五人目は、女の子の１年生ニンジャによるマイクラ作品です。空に浮かぶトナカイとソリに乗っているサンタを建築しました。ソリとトナカイは糸で繋がっており細部まで作り込まれたアイデア作品でした。 隠れ家の家六人目は、男の子の１年生ニンジャによるマイクラ作品です。草の壁や蜘蛛の巣を使用し、わざと古く見える家を建築しました。隠れ家というイメージにあった装飾が見事でした。 全体を通してマイクラ人気が根強いですね。自分が作りたいものを各ニンジャが思い描いた通りに建築できているようで、皆発表も自信満々でイキイキしていました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は1,600円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/12/31/2020-12-26%20%E7%AC%AC%EF%BC%91%EF%BC%94%E5%9B%9E/"},{"title":"第１１回開催レポート　2020/11/08","text":"11月8日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター1人、チャンピオンが集まりCoderDojo大府第11回を開催しました。 開催風景Scratchによる作品作り2人、Minecraft（以下、マイクラ）による作品作り4人です。CoderDojo瀬戸で活躍中のメンターの方がレゴブーストを持参してくれたため、子供達はレゴプログラミングにも興味津々で取り組んでいました。 作品発表ピンポン最初は、男の子の幼稚園年長ニンジャによるScratch作品です。マウスで棒を左右に操作して壁に反射するボールを打ち返すゲームです。棒にふれるたびに得点も加算されるようになっており、ゲームとして高いレベルで仕上がっていました。 すすめ！！トリVS他のゲームのキャラたち二人目は、男の子の４年生ニンジャによるScratch作品です。２人用の格闘対戦ゲームです。お助けアイテム取得時に現れる鳥は、相手の現在位置を計算して角度をつけて突撃するようプログラミングされており、ゲームの質の高さに驚きました。 ウォータースライダーと学校とキャンプ場三人目は、女の子の１年生ニンジャによるマイクラ作品です。学校は下駄箱、教室、図書室、運動場があり、机や黒板等もリアルに再現されており細かな工夫が詰めこまれた作品でした。 高速道路四人目は、男の子の１年生ニンジャによるマイクラ作品です。レールを繋げてトロッコを走らせて高速道路を表現してくれました。またMakeCode機能を使用して線路100個まとめて配置するプログラミングを披露し、皆驚いていました。 学校と川五人目は、男の子の６年生ニンジャによるマイクラ作品です。川が流れる学校を見せてくました。下駄箱やエントランスホールの内装が細かく作り込まれていました。学校内に設置した「お得な掲示板」には給食の献立等が掲載される予定とのことでした。 温泉とプールとウォータースライダー六人目は、男の子の１年生ニンジャによるマイクラ作品です。川の水を利用して作成したプールにはロッカールームや下駄箱が用意されていました。独自の世界観を皆に伝わるようハキハキ説明してくれました。 全体を通して作品製作や発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。今回、マイクラのプログラミングによる線路自動作成をニンジャが披露してくれました。プログラミング活用による建築作業の効率化の良さをニンジャ達に理解してもらって、なんとか流行らせていけたらと思っています。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/11/09/2020-11-08%20%E7%AC%AC%EF%BC%91%EF%BC%91%E5%9B%9E/"},{"title":"第１２回開催レポート　2020/11/29","text":"11月29日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター1人、チャンピオンが集まりCoderDojo大府第12回を開催しました。 開催風景Scratchによる作品作り2人、Minecraft（以下、マイクラ）による作品作り4人です。メンターの方に「micro bit」(手のひらサイズのパソコンのようなもの)とscratchを連携させた作品の紹介をしてもらいました。ニンジャ達は新しいオモチャに目を輝かせていました。また今回はマイクラのプログラミングでジェットコースターを建築する方法を紹介しました。ニンジャだけでなく保護者の方にも好評でした。 作品発表未来のホテル最初は、女の子の１年生ニンジャによるマイクラ作品です。1泊1000円で泊まれる森のホテルを制作しました。プログラミング建築されたジェットコースターにも乗れるお得なホテルでした。 ジェットコースターと地下の部屋二人目は、男の子の１年生ニンジャによるマイクラ作品です。内装がキレイな地下部屋とプログラミング建築されたジェットコースターを制作しました。プログラミングと手作業を組み合わせてジェットコースターを仕上げてくれました。 迷路三人目は、男の子の１年生ニンジャによるScratch作品です。マウスでボールを操作してゴールを目指すゲームです。今後やってみたい改造は、ゴールができなくなるような迷路を制作したいとのことです^^。 川沿いの学校四人目は、男の子の６年生ニンジャによるマイクラ作品です。大人が建築したかのような景観がとても美しい学校を制作しました。今後、教室や理科室や図工室、ランチルームを作成予定とのことです。 花が咲く島五人目は、男の子の３年生ニンジャによるマイクラ作品です。花が敷き詰められた島を制作しました。骨粉というアイテムを使用して花を育てる方法や、模様付きの旗の作り方を紹介してくれました。 馬のあとをついて来る魔法使い と にわとり研究室六人目は、男の子の１年生ニンジャによるScratch作品とマイクラ作品です。Scratchでは動き回る馬のあとを追いかけ続ける魔法使いの作品、マイクラではにわとりの研究所を制作しました。説明がハキハキしていて、とても発表が上手でした。 全体を通して「micro bit」や「ジェットコースタープログラミング」の紹介もあり忙しく楽しく進行することが出来ました。次回も子供達がワクワクするようなプログラミングを紹介できたらと考えています。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/11/30/2020-11-29%20%E7%AC%AC%EF%BC%91%EF%BC%92%E5%9B%9E/"},{"title":"第８回開催レポート　2020/09/20","text":"9月20日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター1人、チャンピオンが集まりCoderDojo大府第8回を開催しました。 開催風景Scratchによる作品作り3人、Minecraft（以下、マイクラ）による作品作り4人です。初参加のニンジャは2人で、Scratchを体験してもらいました。 作品発表公園最初は、女の子の１年生ニンジャによるマイクラ作品です。滑り台、ブランコ、公衆トイレがある公園を作りました。トイレ建築が難しかったとのことでしたが、内装も細かく作りこまれていて非常にキレイなトイレに仕上がっていました。 時間変更の仕掛けとホッパー式タイマー他二人目は、男の子の３年生ニンジャによるマイクラ作品です。マイクラプログラミングをフル活用した作品集です。特にホッパー式タイマー装置は定期的に鐘が鳴る仕組みになっていて色々な仕掛け作りに応用できそうでした。 自分の家三人目は、女の子の幼稚園年中ニンジャによるマイクラ作品です。屋根やドアもある木造の家を作りました。園児でもパソコンを使用して立派な作品を作れることを証明してくれました。 広い川と床がガラスの基地四人目は、男の子の１年生ニンジャによるマイクラ作品です。基地の床がガラスになっていて、ガラスから透けて見える川もキレイでした。作品一つずつをわかりやすく説明してくれて発表も聞きやすかったです。 戦車対戦五人目は、男の子の３年生ニンジャによるScratch作品です。２人用の対戦ゲームです。攻撃をくらった戦車に一時的にモザイクをかけて元の画像に戻す仕組み作成に苦労したようですが、しっかり仕上げてくれて完成度が高いゲームでした。 ジャンプでよけろ六人目は、男の子の２年生ニンジャによるScratch作品です。猫がジャンプでボールをよけるゲームです。ボールに当たった時の処理も作りこみしているけど正しく動作していないとのことでした。動作しない原因を調査する作業は、プログラミングスキル向上に繋がるので、次回参加してくれた時に原因をヒアリングしてみたいと思います。 南方削楽地七人目は、男の子の６年生ニンジャによるScratch作品です。シューティングゲームです。自分から敵への攻撃以外は作りこみされていて、敵からの攻撃をかわすだけでも十分楽しく遊べるレベルに仕上がっていました。完成作品が楽しみです。 全体を通してマイクラもScratchもニンジャ達が楽しんで作品作りに取り組んでいました。初参加のニンジャは難しい作品に挑戦してくれましたが、時間内にしっかりと発表できるレベルに仕上げてくれて今後の活躍が楽しみです。皆堂々と発表をこなしてくれて、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/09/21/2020-09-20%20%E7%AC%AC%EF%BC%98%E5%9B%9E/"},{"title":"第１３回開催レポート　2020/12/12","text":"12月12日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、チャンピオンが集まりCoderDojo大府第13回を開催しました。 開催風景Scratchによる作品作り2人、Minecraft（以下、マイクラ）による作品作り4人、レゴブースト体験1人です。初参加の2名はScratchによる作品作りに取り組みました。 作品発表こうもり軍団をたおせ最初は、男の子の１年生ニンジャによるScratch作品です。迫ってくるこうもりを砲台の玉で撃ち落とすゲームです。１秒毎にこうもりがランダム発生し得点やタイマーも用意されていて、皆で競争できる楽しいゲームでした。 南方スクラッチ二人目は、男の子の６年生ニンジャによるScratch作品です。激しい攻撃をかわしつつ、敵に玉をあてて倒すゲームです。タイトル画面のセンスの良いBGMやスマホプレイ向けに作成されたジョイスティック設置など、細かい部分まで作り込まれたレベルの高いゲームでした。 宝探しゲーム三人目は、男の子の２年生ニンジャによるScratch作品です。りんごとオレンジとダイヤをゲーム開始時に透明化し、徐々に透明効果をなくすようプログラミングされており、見つけたらマウスでクリックするゲームです。時間を競い合えるよう秒数表示も対応しており他のニンジャと対決も楽しめました。 空中階段四人目は、男の子の５年生ニンジャによるScratch作品です。猫をキーボードでスーパーマリオのように操作して、ゴールをタッチするゲームです。初参加にも関わらず難しいプログラミングを仕上げただけでなく、落とし穴や動く障害物設置まで施されており、とても驚かされました。 エリトラ発射台と公園五人目は、女の子の１年生ニンジャによるマイクラ作品です。エリトラという空飛ぶアイテムを使用する高台と公園を建築しました。公園にはジャングルジム、滑り台、ベンチ、噴水が設置されていて花も植えられており美しい景観を実現してくれました。 市場と家六人目は、男の子の１年生ニンジャによるマイクラ作品です。夜になると松明がキレイな家や港を建築しました。港でとれた魚を市場で仕入れてレストランで食事するところまで考えられており、とても想像力豊かな作品でした。 レゴブースト 七人目は、幼稚園年中ニンジャによるレゴブースト作品です。ロボットがバナナの絵柄まで進んで、途中ロケットパンチを発射し、スタート地点まで戻ってくるようプログラミングされていました。 全体を通して初参加のニンジャですが集中して作品制作に取り組み、二人とも完成度の高いゲームを披露してくました。いつも参加してくれいるニンジャも回数を重ねる毎に作品制作のスピードや質があがってきており、発表も上手になってきているため、保護者の方も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2020/12/14/2020-12-12%20%E7%AC%AC%EF%BC%91%EF%BC%93%E5%9B%9E/"},{"title":"第１６回開催レポート　2021/02/21","text":"2月21日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、メンター1人、チャンピオンが集まりCoderDojo大府第16回を開催しました。 開催風景Scratchによる作品作り6人、Minecraft（以下、マイクラ）による作品作り3人です。初めて参加するニンジャにはScratchを体験してもらいました。 作品発表横３色国旗ジェネレータ最初は、男の子の６年生ニンジャによるScratch作品です。旗の色や明るさの調整や文字スタンプを装飾して旗を作成できるプログラムです。キーボード入力した文字をスタンプとして利用できるアイデアも素晴らしく、非常にレベルが高い作品でした。 恐竜たたき二人目は、初参加の男の子の１年生ニンジャによるScratch作品です。ランダムで画面に現れる恐竜をクリックするゲームです。クリックすると「イテーッ」と音声を発する面白い作品でした。 忍者死亡三人目は、初参加の男の子の１年生ニンジャによるScratch作品です。忍者が手裏剣にあたると死亡するゲームです。画面上を動き続ける忍者の動きまでプログラミングできていました。完成が楽しみです。 宝探し四人目は、初参加の男の子の１年生ニンジャによるScratch作品です。画面上の隠された宝をクリックすると音が鳴るゲームです。宝を隠している方法の質問に対しても自信を持って適切な受け答えができていました。 カラーウェーブ五人目は、男の子の１年生ニンジャによるScratch作品です。長方形の色の棒を回転したり、色を変化させることでウェーブに見せる美しい作品です。虹の作り方の質問に対しても丁寧に説明ができていました。 競争六人目は、男の子の３年生ニンジャによるScratch作品です。猫をスペースキーで動かして恐竜やうさぎと競争するゲームです。猫がゴールしたら金メダルが降ってくる仕掛けになっており、皆「おぉー」と感動していました。 洞穴キャンプハウス七人目は、男の子の１年生ニンジャによるマイクラ作品です。穴を掘りその中に建築物を作成されており、天井はガラスにしてあったりと、おしゃれ秘密基地のような作品でした。 島の遺跡八人目は、男の子の１年生ニンジャによるマイクラ作品です。島に穴を掘って遺跡を作成してくれました。遺跡内は立体的な迷路のようなつくりになっていて宝の部屋もあったりと楽しめる遺跡になっていました。 ジェットコースター九人目は、女の子の１年生ニンジャによるマイクラ作品です。巨大なジェットコースターを作成してくれました。途中トロッコをジャンプさせるしかけや、山の中を掘ってトンネルを通過したりと見ている人たちも楽しめる作品でした。 全体を通して初参加ニンジャが３名いましたが保護者の方と支援のもと作品制作に取り組み、堂々と発表できていたことが印象的でした。２回目以降のニンジャ達は制作時間中も他の子の作品制作をフォローする余裕もあり、ワイワイ楽しそうに取り組んでいました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,400円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/02/22/2021-02-21%20%E7%AC%AC%EF%BC%91%EF%BC%96%E5%9B%9E/"},{"title":"第１９回開催レポート　2021/03/21","text":"3月21日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター1人、チャンピオンが集まりCoderDojo大府第19回を開催しました。 開催風景すべてのニンジャがScratchによる作品制作に取り組みました。終始ワイワイ賑やかに進行しました。 作品発表キャッチゲーム最初は、男の子の１年生ニンジャの発表です。おわんを左右に動かして上から落ちてくるりんごをキャッチするゲームです。おわんを早く動かせるよう工夫されていました。 アナ雪二人目は、女の子の幼稚園年中ニンジャの発表です。手書きのアナ雪によるアニメーション作品です。各キャラクターの声は自分の声を録音再生し、独特の物語も面白く、続編が見たくなる作品でした。 シューティングゲーム三人目は、女の子の１年生ニンジャの発表です。モンスターと狐がボールをぶつけ合う二人用の対戦ゲームです。HPが半分になったら発動できる必殺技に対しての質問も、わかりやすく回答してくれました。 ドラゴンVS魔法使い四人目は、男の子の１年生ニンジャの発表です。ドラゴンと魔法使いが戦う二人用の対戦ゲームです。めちゃくちゃ盛り上がって対戦を楽しんでいました。 エアーホッケー五人目は、男の子の１年生ニンジャの発表です。上下のバーを動かして相手のゴールを狙う昔ゲームセンターによくあった対戦ゲームです。制作時の困った点についての質問に対して、論理的にわかりやすく説明してくれました。 猫たたき六人目は、男の子の３年生ニンジャの発表です。穴からランダムに出現する猫をたたくゲームです。乱数を活用したランダムに出現/隠れる仕組みや、点数加算の仕組みも出来ており、完成度が高い仕上がりでした。 太鼓叩き七人目は、男の子の３年生ニンジャの発表です。太鼓の達人を再現してくれました、制作難易度の高い作品でしたが、リズムに合わせて色に対応したボタンを押すと太鼓の色が変わる動作が実現できており、ゲームの完成度が高かったです。 全体を通して制作時間に周りのメンバを巻き込んで疑問点を解決していく光景が多く見られたことが印象的です。発表時にニンジャからの質問が多いことや、相手に頑張って回答を伝えようとしている姿が多く見られたことも非常に良かったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/03/21/2021-03-21%20%E7%AC%AC%EF%BC%91%EF%BC%99%E5%9B%9E/"},{"title":"第１５回開催レポート　2021/01/11","text":"1月11日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター2人、チャンピオンが集まりCoderDojo大府第15回を開催しました。 開催風景Scratchによる作品作り2人、Minecraft（以下、マイクラ）による作品作り5人です。初めて参加するニンジャにはScratchを体験してもらいました。 作品発表ボート乗り場とモダンなレンガハウスと畑と動物園最初は、男の子の１年生ニンジャによるマイクラ作品です。レンガハウスや畑や動物園すべてが細かな部分までこだわって建築されており周りのニンジャも感心していました。 ジェットコースター二人目は、男の子の３年生ニンジャによるマイクラ作品です。超巨大なジェットコースターです。自然の障害物を利用して上下左右にレールが敷いてあり楽しいコースに仕上がっていました。 理科室と職員室三人目は、男の子の６年生ニンジャによるマイクラ作品です。理科室は実験台や原子記号ブロックで美しい仕上がりでした。ランチルーム・教室・家庭科室を今後建築予定とのことで楽しみです。 ツリーハウス四人目は、男の子の１年生ニンジャによるマイクラ作品です。巨大な木と家が一体化した家です。木や葉っぱも自分で建築されており、おしゃれなツリーハウスとなっていました。 地下室五人目は、女の子の１年生ニンジャによるマイクラ作品です。シーランタンで明るい巨大な地下室を建築しました。松明よりシーランタンの方が明るいという豆知識も披露してくれました。 おみくじ六人目は、メンターによるScratch作品です。高速で切り替わる画面を携帯カメラで撮影することでおみくじが楽しめる作品です。ニンジャ達が激しく連射して撮影してました。 太鼓七人目は、男の子の幼稚園年長ニンジャによるScratch作品です。太鼓の達人のようなゲームです。タイミングよくクリックすることで色に応じた音がなる仕組みに仕上げてくれました。 カラーウェーブ八人目は、男の子の３年生ニンジャによるScratch作品です。色が変化しながら波のように動く作品です。非常に見た目も綺麗でニンジャ達から「おぉー」と歓声があがっていました。 全体を通していつもより参加者が多めで賑やかな開催となりました。作品発表は初参加のニンジャも含めて皆イキイキと発表していました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/01/12/2021-01-11%20%E7%AC%AC%EF%BC%91%EF%BC%95%E5%9B%9E/"},{"title":"第１７回開催レポート　2021/02/28","text":"2月28日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター1人、チャンピオンが集まりCoderDojo大府第17回を開催しました。 開催風景Scratchによる作品作り3人、Minecraft（以下、マイクラ）による作品作り5人です。初めて参加するニンジャにはScratchを体験してもらいました。この日は教育版マイクラの利用期限の最終日ということもあり、マイクラ制作に取り組むニンジャが多かったです。 作品発表エアーホッケー最初は、男の子の３年生ニンジャによるScratch作品です。二人で楽しめるエアーホッケーです。バーにボールが触れたら跳ね返るようするのが難しかったとのこと。色々なゲームに応用できそうな経験をしてくれたと思います。 だんまくをよけろ二人目は、男の子の１年生ニンジャによるScratch作品です。ロケットを操作して不規則な動きをするボールをかわすゲームです。ボールが増えていく仕組みになっており難易度高めでした。今後やってみたい改造はロケットを増やしたいとのことでした。 ねこあるき三人目は、初参加の男の子の１年生ニンジャによるScratch作品です。ねこやクラゲやダンサーやこうもりが画面上を跳ね返りながら歩き続ける作品です。各キャラのコスチュームが編集されており賑やかな仕上がりになっていました。 モンスターが入れない家四人目は、男の子の３年生ニンジャによるマイクラ作品です。モンスターが入れない家を建築しました。ボタンで動作するピストンを階段のように利用して家に入れる仕組みでした。シンプルですが便利な仕組みでした。 職員室と体育館の骨組み五人目は、男の子の６年生ニンジャによるマイクラ作品です。学校の職員室と体育館を建築しました。職員室はおしゃれな会議室や消臭剤がリアルに再現されておりレイアウトがとても綺麗でした。 恐竜のおうち六人目は、男の子の１年生ニンジャによるマイクラ作品です。恐竜のかたちをした家を建築しました。恐竜の口にあるレバーをONにすると口から火が発射する仕組みが面白かったです。 ジェットコースター七人目は、女の子の１年生ニンジャによるマイクラ作品です。巨大なジェットコースターを建築しました。トンネルありジャンプ台ありの楽しいアトラクションに仕上がっていました。 島の遺跡八人目は、男の子の１年生ニンジャによるマイクラ作品です。島に穴を掘って遺跡を作成してくれました。宝の部屋を守るゾンビを倒して宝を手に入れるところまでを楽しく説明してくれました。 全体を通してニンジャ達が制作時間中も互いにコミュケーションをとりながら楽しそうに取り組んでいる光景が多く見られたことが印象的でした。今後もゆるーく楽しくやっていけたらと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/03/01/2021-02-28%20%E7%AC%AC%EF%BC%91%EF%BC%97%E5%9B%9E/"},{"title":"第１８回開催レポート　2021/03/14","text":"3月14日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、メンター1人、チャンピオンが集まりCoderDojo大府第18回を開催しました。 開催風景すべてのニンジャがScratchによる作品制作に取り組みました。Scratchを久しぶりに触るというニンジャが多く、自分やメンターはニンジャからの質問攻めで大忙しでした。 作品発表キャッチゲーム最初は、男の子の３年生ニンジャの発表です。おわんを左右に動かして上から落ちてくる卵をキャッチするゲームです。卵を落としたら割れて、キャッチ成功でひよこになるアイデアが面白かったです。 きょうそう二人目は、男の子の１年生ニンジャの発表です。画面上のボタンを連打して猫を走らせるゲームです。作品への質問に対して堂々と丁寧に答えてくれたことが印象的でした。 魚のアニメーション三人目は、男の子の１年生ニンジャの発表です。鳥がパクっと魚を食べるアニメーションです。自分の声を録音して、タイミングよく「パクッ」「ワー！」と再生される仕掛けが面白かったです。 ものがたり四人目は、女の子の幼稚園年中ニンジャの発表です。妖精が洞窟に向かっていき、洞窟に入ったら背景が暗くなり、バスケットボールをブツケられるというアニメーションです。独特の物語が面白かったです。 シューティングゲーム五人目は、女の子の１年生ニンジャの発表です。モンスターと狐がボールをぶつけ合う二人用の対戦ゲームです。ボールに当たったらHPが減少する仕組みになっておりゲームとしての完成度が高かったです。 ドラゴンVS魔法使い六人目は、男の子の１年生ニンジャの発表です。ドラゴンと魔法使いが戦う二人用の対戦ゲームです。ボタン押下でドラゴンの火攻撃を繰り出すプログラミングが難しかったとのことでしたが、しっかり攻撃できてました。 エアーホッケー七人目は、男の子の１年生ニンジャの発表です。上下のバーを動かして相手のゴールを狙う二人用の対戦ゲームです。残念ながら作品の保存に失敗してしまいゲームプレイできなかったです。次回作品に期待です！！ キャットジャンプ八人目は、男の子の６年生ニンジャの発表です。猫をジャンプさせて蛇をかわすゲームです。Chromeブラウザでインターネットが繋がらない時にできるゲームを真似て作ってくれました。背景横スクロールの仕組みが見事でした。 恐竜よ、サボテンをよけろ！九人目は、男の子の３年生ニンジャの発表です。恐竜をジャンプさせてサボテンをかわすゲームです。こちらもChromeブラウザでインターネットが繋がらない時にできるゲームを真似て作ってくれました。同じテーマでの作品制作は比較できて面白いですね！！ 全体を通して久しぶりの全員Scratchで大忙しでしたが楽しかったです。発表では二人用のゲームを発表しているニンジャがちらほらいましたが、一緒に楽しそうにプレイしている姿を見ていると、こちらも楽しくなりますね。今後もゆるーく楽しくやっていけたらと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/03/16/2021-03-14%20%E7%AC%AC%EF%BC%91%EF%BC%98%E5%9B%9E/"},{"title":"第２０回開催レポート　2021/04/04","text":"4月4日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)5人、メンター1人、チャンピオンが集まりCoderDojo大府第20回を開催しました。 開催風景Scratchによる作品制作に取り組みました。 作品発表おばけから逃げろ最初は、女の子の幼稚園年長ニンジャの発表です。猫や恐竜を操作しておばけから逃げるゲームです。二人同時にプレイできるよう猫はマウス操作、十字キーは恐竜操作となっており盛り上がるゲームでした。 ブロックくずし二人目は、男の子の２年生ニンジャの発表です。ボールが落ちないようバーを左右に操作してブロックをくずすゲームです。ブロックを消す仕組みについての質問に対してもしっかり回答できていました。 ゴキブリから逃げろ三人目は、女の子の２年生ニンジャの発表です。２匹のユニコーンを操作してゴキブリから逃げるゲームです。ゴキブリに触れたらHPが減少し、涙のコスチュームに変化する仕組みが良かったです。 ドラゴンVS魔法使い四人目は、男の子の２年生ニンジャの発表です。ドラゴンと魔法使いが戦う二人用の対戦ゲームです。相手を倒したらキャラクターが倒れるようプログラミングされているところや、自分が好きなドラクエの音楽を使用しているところが良かったです。 大乱闘スマッシュブラザーズ五人目は、男の子の４年生ニンジャの発表です。相手を落としたら勝ちとなる二人用の対戦ゲームです。制作途中ではありましたが、ボタン押下による攻撃発動やキャラクターがジャンプできる仕組みはバッチリ動作していました。 全体を通して二人用のゲーム作品が多く、発表は大いに盛り上がりました。それぞれのニンジャが作ったゲームを皆で楽しむ光景が多く見られて非常に良かったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は1,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/04/06/2021-04-04%20%E7%AC%AC%EF%BC%92%EF%BC%90%E5%9B%9E/"},{"title":"第２３回開催レポート　2021/07/11","text":"7月11日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)12人、メンター2人、チャンピオンが集まりCoderDojo大府第23回を開催しました。 祝！CoderDojo大府１周年メンターの方が１周年記念のシールを制作してくれました！！メチャクチャ嬉しかったです！！ニンジャ達も自分のパソコンにシール貼ったりしてました。 開催風景Scratchによる作品制作に取り組みました。ニンジャ12人は過去最大です。 作品発表にげろ！こねこちゃん最初は、男の子の２年生ニンジャの発表です。猫を十字キーで操作してランダムに動くボールをかわすゲームです。カラフルなボールがかわいいです。 なぞのモンスターをたおせ二人目は、男の子の２年生ニンジャの発表です。勇者を十字キーで操作してモンスターを倒しにいくゲームです。ドラクエの勇者画像に、みんな興味津々でした。 ジャンプでよけろ三人目は、初参加の男の子の３年生ニンジャの発表です。せまってくるボールを猫がジャンプしてかわすゲームです。ボールに当たった時の判定もしっかり出来ていました。 コウモリにあたるな！四人目は、女の子の２年生ニンジャの発表です。猫をマウスで操作してランダムに動くコウモリをかわすゲームです。コウモリに触れたらHPが減っていく仕組みもしっかり動作していました。 魚つかまえフグめいろ五人目は、男の子の２年生ニンジャの発表です。ダイバーをマウスで操作してゴールを目指す迷路ゲームです。壁に当たったら「ビリビリ」と録音した音声がなるアイデアが面白かったです。 猫と星六人目は、初参加の女の子の３年生ニンジャの発表です。開始ボタン押下と同時に、猫が少し動く作品でした。自作の星イラストがかわいかったです。 ポケモン七人目は、初参加の男の子の１年生ニンジャの発表です。ポケモンのキャラクターイラストを作成してくれました。強そうなポケモンでした。 忍者 v.s. フクロウ八人目は、初参加の女の子の６年生ニンジャの発表です。忍者を十字キーで操作して、ランダムに出現するコウモリを手裏剣で倒すゲームです。完成度が高かったです。 一応……サンプル九人目は、男の子の５年生ニンジャの発表です。地図によるステージ選択あり、アクションありの、敵がいないスーパーマリオのようなゲームです。プログラミングの作り込みがすごいです。scratchの大府スタジオからプレイしてみましょう。 ソニファン十人目は、初参加の男の子の４年生ニンジャの発表です。猫を操作して敵を倒す格闘ゲームです。スペースキー押下で発射する波動拳（ストⅡ）のような攻撃がカッコ良かったです。 あおをさがせ十一人目は、女の子の幼稚園年長ニンジャの発表です。時間とともに表示されてくる画像を見つけてクリックするゲームです。透明度や魚眼レンズの画像効果が面白かったです。 全体を通して久しぶりの開催でしたが、おおいに盛り上がりました。初参加の子が多く、チャンピオン＆メンターは大忙しでしたが、経験豊富な子供メンターが、初めての子を積極敵にサポートしてくれて非常に頼もしかったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/07/14/2021-07-11%20%E7%AC%AC%EF%BC%92%EF%BC%93%E5%9B%9E/"},{"title":"第２１回開催レポート　2021/04/18","text":"4月18日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)5人、メンター1人、チャンピオンが集まりCoderDojo大府第21回を開催しました。 開催風景Scratchによる作品制作に取り組みました。 作品発表ジャンプで避けろ最初は、男の子の２年生ニンジャの発表です。突撃してくれるドラゴンをジャンプでかわすゲームです。ドラゴンに触れたら自分が回転する仕組みになっていました。背景が動くようプログラムしている途中とのことで、完成が楽しみな作品です。 ドラゴンVS魔法使い二人目は、男の子の２年生ニンジャの発表です。ドラゴンと魔法使いが戦う二人用の対戦ゲームです。今日はドラゴンとデスピサロを倒したら勝利の音楽が流れる仕組みを作りました。発表時に音楽が無事流れたので、とても嬉しそうでした。 こうもり軍団を倒せ三人目は、女の子の２年生ニンジャの発表です。上から迫ってくるコウモリを砲弾で撃ち落とすゲームです。コウモリは色々な場所にどんどん湧いてくる仕組みになっており、忙しい楽しいゲームに仕上がっていました。 南方スクラッチ四人目は、男の子の中学１年生ニンジャの発表です。敵と１対１で戦うシューティングゲームです。今日は、タイトルメニュー選択画面で動作しなくなるバグ対策をしました。敵の動きが細かく作り込まれており何度やっても楽しいゲームです。必殺技が実装予定のとことで楽しみにしています。 QRコードリーダー五人目は、男の子の４年生ニンジャの発表です。USB接続した小型カメラでQRコードを読み取る装置を作成しました。読み取れたQRコードの内容は画面表示されるようになっており、みんな新しい技術にビックリしていました。 全体を通して参加ニンジャそれぞれがプログラミングや発表を元気に前向きに取り組んでいました。ScratchのQRコードリーダーは、自分も含めて周りのニンジャも初めて見たので感動しました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は1,900円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/04/23/2021-04-18%20%E7%AC%AC%EF%BC%92%EF%BC%91%E5%9B%9E/"},{"title":"第２５回開催レポート　2021/08/08","text":"8月8日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター1人、チャンピオンが集まりCoderDojo大府第25回を開催しました。 開催風景Scratch、マイクラによる作品制作に取り組みました。 作品発表動物園と秘密部屋最初は、女の子の２年生ニンジャのマイクラ作品です。動物園と天空の秘密部屋を発表しました。 博物館と迷路二人目は、男の子の２年生ニンジャのマイクラ作品です。レンガ造りの博物館とゴール時に打ち上げ花火が発射される迷路を発表しました。 鶏小屋三人目は、男の子の１年生ニンジャのマイクラ作品です。初マイクラ経験で、鶏小屋を発表しました。 ダイヤモンドのおうち四人目は、女の子の幼稚園年長ニンジャのマイクラ作品です。ケーキがいっぱいのダイヤモンドブロックで制作した家を発表しました。 森の豊かさを守ろう五人目は、男の子の４年生ニンジャのマイクラ作品です。マイクラカップ2021のお題に合わせて緑あふれる作品を発表しました。 なぞのモンスターをたおせ六人目は、男の子の２年生ニンジャのScratch作品です。勇者が闘技場で敵と戦うゲームです。変数を利用してHPを表現していました。 忍者VSこうもり七人目は、初参加の男の子の１年生ニンジャのScratch作品です。ランダムに出現するこうもりを忍者が手裏剣を投げて倒すゲームを発表しました。 全体を通してマイクラは１，２年生のニンジャでも大人のフォローがなくても作品制作を順調に進められている印象です。ただ、プログラミングしなくても作品制作が出来てしまうので、今後も積極的にマイクラのプログラミングやレッドストーン装置などの紹介を続けていこうかと考えています。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/08/12/2021-08-08%20%E7%AC%AC%EF%BC%92%EF%BC%95%E5%9B%9E/"},{"title":"第２２回開催レポート　2021/05/09","text":"5月9日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオンが集まりCoderDojo大府第22回を開催しました。 開催風景Scratch、toioによる作品制作に取り組みました。toioはキューブ型のロボットで、Scratchのようにプログラミングができます。toio作品制作は大府で初めてです。 ワークショップカメラを使おうメンターの方がScratchでのカメラの使い方や、カメラで動きを検知し音を鳴らすプログラミング方法を、Scratchで作成したスライドアニメでニンジャたちに伝授してくれました。ニンジャたちの反応も良くScratch画面上に映る自身の顔を見て興奮していました。 作品発表ボーンナイトから逃げろ最初は、男の子の２年生ニンジャの発表です。戦士をマウスで操作して突撃してくるボーンナイトをかわすゲームです。音楽を鳴らしながら遊べるよう作り込み途中とのことで完成が楽しみです。 さかな二人目は、男の子の１年生ニンジャの発表です。魚釣りゲームです。動き回る魚にふれるだけのゲームではなく、釣った魚をコップまで運んで遊ぶゲームになっていて、楽しいゲームに仕上がっていました。 作品１三人目は、初参加の男の子の５年生ニンジャの発表です。ニンジャをキーボードで操作し、ランダムな場所に湧くコウモリを手裏剣で倒すゲームです。今後はアニメ制作にも取り組みたいとのことで、どんどん挑戦していってほしいです。 ねこから逃げろ四人目は、初参加の女の子の１年生ニンジャの発表です。ネズミをマウスで操作してねこから逃げるゲームです。マウスポインターにねずみを向けるようにプログラミングされていました。初めての発表でしたが大きな声で発表できている姿が印象的でした。 すすめ！トリ クエスト五人目は、男の子の５年生ニンジャの発表です。トリを操作して障害物をかわしながら各ステージをクリアしていくゲームです。途中でアイテムが購入できたりと楽しい要素が盛りだくさんの超大作でした。 透明なねこ六人目は、初参加の女の子の３年生ニンジャの発表です。ネズミをマウスで操作して透明なねこから逃げるゲームです。見えない猫から逃げるという、みんなが思いつかないアイデアが素敵でした。 toio七人目は、男の子の４年生ニンジャの発表です。キューブ型ロボットをマットに置いたら、音が鳴り、２体のロボットがマットの対角線上の隅に自動で移動するようプログラミングされていました。プログラミングロボットにニンジャたちは興味津津でした。 おえかき八人目は、女の子の２年生ニンジャの発表です。画面下のパレットで色を選択し、おえかきが楽しめるゲームです。ペンの太さも自由に変更できるよう工夫されていました。 全体を通して初めてのワークショップ、初めてのtoio作品発表、みんなで非常に盛り上がりました。今後もニンジャたちがワクワクするような事をしていきたいです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/05/10/2021-05-09%20%E7%AC%AC%EF%BC%92%EF%BC%92%E5%9B%9E/"},{"title":"第２４回開催レポート　2021/07/25","text":"7月25日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオンが集まりCoderDojo大府第24回を開催しました。 開催風景Scratch、マイクラによる作品制作に取り組みました。 メンター作品発表コア・ファイターの写真を撮りたいオジサン男の子の小学校４４年生メンターがTOIO（SONY製ロボットおもちゃ）作品を披露してくれました。動き回るコア・ファイターを追いかけるオジサンを見て、皆爆笑してました。 ニンジャ作品発表ニャンコライフ最初は、男の子の５年生ニンジャのScratch作品です。一つの作品の中で、「牛の乳搾りゲーム」や「羊をオオカミから守る」のゲームを披露してくれました。ミニゲームがたくさんある育成ゲームのような感じです（本当すごいゲームです）。 卵を追いかけろ二人目は、女の子の３年生ニンジャのScratch作品です。画面上にランダムで出現する卵を女の子が追いかけるゲームです。卵の複製は、学習したクローンの仕組みを利用しており、シンプルに楽しめるゲームでした。 猫を追いかけろ三人目は、初参加の男の子の１年生ニンジャのScratch作品です。ネズミを操作して、猫から逃げるゲームです。逃げている間、猫がニャーニャー泣き続ける賑やかなゲームでした。 なぞのモンスターをたおせ四人目は、男の子の２年生ニンジャのScratch作品です。勇者を十字キーで操作してモンスターを倒しにいくゲームです。勇者が闘技場に着いた時に、懐かしいドラクエⅤのBGMが流れる仕組みになっており、惹かれるゲームでした。 恐竜博物館五人目は、男の子の２年生ニンジャのマイクラ作品です。プログラミングロボットに博物館の壁を自動で建築させるプログラミングを披露してくれました。 おうち六人目は、女の子の幼稚園年長ニンジャのマイクラ作品です。カラフルなガラスブロックで建築された２階建ての家を建築してくれました。 図書館七人目は、男の子の２年生ニンジャのマイクラ作品です。パソコンでのマイクラ操作は初めてとのことでしたが、巨大な図書館を建築してくれました。 ジェットコースター八人目は、女の子の２年生ニンジャのマイクラ作品です。巨大なジェットコースターを建築してくれました。 全体を通してマイクラ人気が凄いです。マイクラのプログラミングを活用して、建築の効率化を目指していたニンジャがいて嬉しかったです。単純作業はプログラミングで自動化できる可能性が高いことを、実際に体験しながら理解してもらえると嬉しいですね。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/07/29/2021-07-25%20%E7%AC%AC%EF%BC%92%EF%BC%94%E5%9B%9E/"},{"title":"第３０回開催レポート　2021/12/26","text":"12月26日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)13人、メンター2人、チャンピオンが集まりCoderDojo大府第30回を開催しました。 開催風景scrath、micro;bit、Unity、Teachable Machine、toio、マインクラフト等の様々な作品制作に取り組みました。 作品発表toioクリスマスのBGMが流れる中、サンタがコアファイターを追いかける作品を発表しました。本当に追いかけているような動きが非常に面白かったです。 micro:bitmicrob:bitとscratchを連携しガンダムとザクが戦う作品を発表しました。micro:bitのボタン押下や傾けることでザクを操作しており、大人も楽しめる作品でした。 scratch初参加のニンジャは教材に沿った作品をおすすめしていますが、どの作品も教材をそのまま使っただけの作品は一つもなく、どれも個性的な改造が施されており見ていて面白かったです。また、scratch熟練ニンジャによる、にゃんこ大戦争や、大乱闘スマッシュブラザーズの作品発表は、他のニンジャ達も大いに刺激を受けたのではと感じました。 Teachable Machine機械学習により顔や声から人物を特定するという作品を発表しました。カメラ撮影中の人物の認識率の正確さを実演し、自分も含めみんな本当に驚かされました。 Unity3Dの空間でプレイヤーを操作して、敵を銃で倒していくゲームです。既にインターネット上に公開されているサンプルプログラムを流用して作成したとのことですが、Unityのプログラムを改造できる小学生は、かなりレアと思われます。（凄すぎます。） マインクラフトクリスマスプレゼントやおしゃれな家を建築してくれました。レッドストーンによる自動ドアの仕掛け等、工夫されていました。 全体を通して今回は、過去最大の参加人数でしたが、小学生メンターの活躍もあり、みんなプログラミングや作品発表を楽しめたのではと思います。作品発表を通して、ニンジャ同士が刺激を受けている様子が見られたのが、とても嬉しかったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/12/26/2021-12-26%20%E7%AC%AC%EF%BC%93%EF%BC%90%E5%9B%9E/"},{"title":"第２６回開催レポート　2021/08/22","text":"8月22日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター1人、チャンピオンが集まりCoderDojo大府第26回を開催しました。 開催風景Scratch、マイクラによる作品制作に取り組みました。 作品発表手裏剣は顔面から最初は、男の子の５年生ニンジャのScratch作品です。手裏剣を投げてランダム出現するコウモリを倒し続けるゲームです。 キャッチゲーム二人目は、女の子の３年生ニンジャのScratch作品です。落ちてくるりんごを、おわんでキャッチするゲームです。 ジャイアンバットからにげろ三人目は、男の子の２年生ニンジャのScratch作品です。画面を動き回るジャイアントバットを交わし続けるゲームです。 秘密基地四人目は、男の子の２年生ニンジャのマイクラ作品です。巨大な雪山を掘って、デザイン性の高い秘密基地を建築しました。 色々な装置五人目は、男の子の５年生ニンジャのマイクラ作品です。きつね捕獲装置、うさぎ捕獲装置、火の玉連射装置、自動羊毛回収装置を建築しました。 天気を自在に操る人六人目は、男の子の４年生ニンジャのマイクラ作品です。プログラミングを活用し、ブロック破壊により「晴れ」「雨」が切り替わる仕組みを作成しました。 レストラン七人目は、女の子の２年生ニンジャのマイクラ作品です。マイクラカップを意識したレストランで、食べ残しを肥料（骨粉）に有効活用する仕組みを作成しました。 全体を通してマイクラやScratchでニンジャ達が互いに教え合う姿が多く見られてよかったです。また、高学年ニンジャ達のプログラミングの理解・成長が早すぎて、親がついていけていない程で、頼もしいです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/08/26/2021-08-22%20%E7%AC%AC%EF%BC%92%EF%BC%96%E5%9B%9E/"},{"title":"第２８回開催レポート　2021/10/31","text":"10月31日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)5人、メンター1人、チャンピオンが集まりCoderDojo大府第28回を開催しました。 開催風景初参加のニンジャはscrath、他のニンジャはmicro:bitやマインクラフトによる作品制作に取り組みました。 作品発表micro:bitmicrob:bitで車を動かしたり、じゃんけんする作品を発表しました。想定どおりにロボットが動いたようで、ニンジャが大喜びしていました。 マイクラ畑の自動収穫機やパンダへの自動餌まき機などの作業を自動化する作品や、マイクラ上のレバーを操作することで村人が発生する作品、ロボットが「happy halloween」の文字をブロックで描く作品と、どの作品もアイデアが面白く魅力的でした。 scratch虹がウェーブ状に動作する作品を発表しました。初参加とは思えない堂々とした発表でした。 全体を通して和気あいあいと作品制作、発表を楽しむことができました。各ニンジャがプログラミングを楽しんでいる姿を見ると、こちらも嬉しくなりますね。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付1,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/11/01/2021-10-31%20%E7%AC%AC%EF%BC%92%EF%BC%98%E5%9B%9E/"},{"title":"第２７回開催レポート　2021/10/17","text":"10月17日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、チャンピオンが集まりCoderDojo大府第27回を開催しました。 開催風景この日は、TFabWorksさんからmicro:bitを借用し、ニンジャたちに体験してもらいました。 作品発表micro:bitほとんどのニンジャがmicro:bitのプログラミングが初めてでしたが、LED点灯や音を鳴らすプログラミングを、ばっちりマスターしていました。加速度センサーや温度計を使った作品もあり、周りのニンジャたちが声をあげて驚いていました。 マイクラスカイラウンジもある高層ビルや、未来の家を発表しました。建築レベルの高さに驚いたニンジャたちが「うぇーい」と叫んで盛り上がっていました。 全体を通してmicro:bitのプログラミング体験や発表は初めての試みでしたが、ニンジャ達が楽しそうに作品制作、発表に取り組んでくれていたようで安心しました。今後もニンジャ達に色々な体験をしてもらえるように取り組んでいけたらと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付1,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/10/19/2021-10-17%20%E7%AC%AC%EF%BC%92%EF%BC%97%E5%9B%9E/"},{"title":"第３２回開催レポート　2022/01/23","text":"1月23日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター1人、チャンピオンが集まりCoderDojo大府第32回を開催しました。 開催風景scrath、micro;bit、レゴブースト、Teachable Machineの作品制作に取り組みました。 作品発表micro:bit &amp; レゴブーストmicro:bitのタコ足ロボットが赤外線センサーを利用してレゴーブーストを追いかける作品です。タコ足ロボットの足が遅いため追いつくまではいかなかったもののアイデアがとても面白く盛り上がりました。 micro:bit &amp; scratchmicro:bitのLEDランプで自分の名前や表情のアイコンが表示される作品や、scratchで作成した太鼓ゲームにmicro:bitで太鼓のバチを操作できるように改造した本当に楽しめるゲームを披露してくれました。 scratchスーパーマリオを再現したゲーム、タイマーアラート、忍者対こうもりの作品を発表しました。どの作品もアイデアが面白いです。 Teachable Machine &amp; scratchマイクで拾った声を識別して、発生した人の名前をscratchに表示する作品です。事前にサンプリングした音声データと照合する仕組みを、目に見える形にして説明してもらえたのは、感動しました。 全体を通して今回は、miro:bitの作品発表が3作品あり、micro:bitブームの到来を感じました。ニンジャ達が作品制作や発表に楽しそうに取り組む姿が多く見られ、保護者の方も楽しんでもらえたのではないかと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付3,400円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/01/23/2022-01-23%20%E7%AC%AC%EF%BC%93%EF%BC%92%E5%9B%9E/"},{"title":"第２９回開催レポート　2021/11/28","text":"11月28日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、メンター1人、チャンピオンが集まりCoderDojo大府第29回を開催しました。 開催風景初参加のニンジャはscrath、他のニンジャはmicro:bitやマインクラフトによる作品制作に取り組みました。 作品発表micro:bitmicrob:bitでボタン押下や本体を傾けることで、名前やメッセージを表示する作品を発表しました。5*5のLEDライトで漢字を表現していたのが面白かったです。 マイクラ入り口のドアをつくらず、スライムブロックをトランポリンのように活用しないと入れない家を建築しました。ゾンビ対策ばっちりです。 scratchscratchで作成した「なぞなぞ」の問題の作品は、大人も全然わからない難問でしたが、ニンジャが鮮やかに答えを導きだしており拍手がおこっていました。発表が初めて又は２回目のニンジャによる作品が多かったですが、みんな堂々と作品説明が出来ており素晴らしかったです。 全体を通して保護者の方もニンジャ達と一緒に作品制作を楽しでいる様子が多く見られて良かったです。これからも、ゆるーく楽しいコミュティとして続けていけたらと思っています。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付4,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2021/11/28/2021-11-28%20%E7%AC%AC%EF%BC%92%EF%BC%99%E5%9B%9E/"},{"title":"第３１回開催レポート　2022/01/16","text":"1月16日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、メンター1人、チャンピオンが集まりCoderDojo大府第31回を開催しました。 開催風景scrath、micro;bit、Unity、マインクラフトの作品制作に取り組みました。 作品発表micro:bitプログラミング・フォロ for micro:bitというタコ足のロボットをmicro:bitのボタンに反応して回転したり後ろ歩きする作品を発表しました。 Unityキーボードで猫を左右に操作して、上から降ってくる矢印をかわすゲームです。Unityのプログラムコードも披露してくれました。 マインクラフト山の頂上から入ることができる秘密基地を建築しました。 scratchサメをかわしながら鏡餅をGETするゲームや、脱出ゲームなど子供達の個性が出ている作品が多かったです。scratchの拡張機能を活用して、音声読み上げする多言語翻訳ソフトをサクッと作成し、「こんにちは」→「ニイハオ」の翻訳＆読み上げを実演してくれた凄腕のニンジャもいました。 全体を通して今回は、ニンジャ達それぞれが思い描いている作品の実現に向かって、一生懸命取り組んでいる様子が多く見られました。みんな自分の作品に自信を持てているのが、発表を通して伝わって来たことが良かったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/01/18/2022-01-16%20%E7%AC%AC%EF%BC%93%EF%BC%91%E5%9B%9E/"},{"title":"第３６回開催レポート　2022/04/10","text":"4月10日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、チャンピオンが集まりCoderDojo大府第36回を開催しました。 開催風景scrath、toioの作品制作に取り組みました。 作品発表scratch &amp; toio scratch作品の発表は対戦ゲームやクイズゲームや続きが気になるアニメーション作品など皆で楽しめました。toioではscratch連携でキューブを動作させたり、パソコンを使用せず、命令カードを読み込ませてキューブを動かす作品に大人達も感動していました。 全体を通してScratchもtoioも各作品に子供達独自の工夫が詰め込まれており、見ていた側も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/04/12/2022-04-10%20%E7%AC%AC%EF%BC%93%EF%BC%96%E5%9B%9E/"},{"title":"第３４回開催レポート　2022/03/06","text":"3月6日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター1人、チャンピオンが集まりCoderDojo大府第34回を開催しました。 開催風景scrath、micro:bitの作品制作に取り組みました。 作品発表scratch &amp; micro:bit 2人の5年生ニンジャが、鬼が自給自足するシュミレーションゲームや、ステージが5つ程度あるアクションゲームを発表してくれましたが、プログラムの作り込み量がとても多く、みんな驚かされました。他のニンジャ達も個性的な作品で楽しませてくれました。 全体を通して保護者の方が寄り添って、ニンジャ達と一緒に考えながら進めている光景が多く見られました。作品発表では各ニンジャが自信をもって自分の作品を発表しており、保護者の方も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は1,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/03/06/2022-03-06%20%E7%AC%AC%EF%BC%93%EF%BC%94%E5%9B%9E/"},{"title":"第３５回開催レポート　2022/03/20","text":"3月20日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)10人、チャンピオンが集まりCoderDojo大府第35回を開催しました。 開催風景scrath、プログラミングロボット・フォロの作品制作に取り組みました。 作品発表scratch &amp; プログラミングロボット・フォロ ２年生ニンジャのプログラミングロボット・フォロによる赤外線センサーを利用した障害物を回避するプログラムには驚かされました。またscratch作品の発表は、中学生ニンジャによる玉転がしゲームの美しい背景や3Dゲームのようなゲームステージに皆が目を丸くしていました。他のニンジャ達も個性的な作品で楽しませてくれました。 全体を通して保護者の方が寄り添って、ニンジャ達と一緒に考えながら進めている光景が多く見られました。作品発表では各ニンジャが自信をもって自分の作品を発表しており、保護者の方も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,100円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/03/20/2022-03-20%20%E7%AC%AC%EF%BC%93%EF%BC%95%E5%9B%9E/"},{"title":"第３３回開催レポート　2022/02/27","text":"2月27日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)5人、チャンピオンが集まりCoderDojo大府第33回を開催しました。 作品発表scratch &amp; micro:bit 1年生ニンジャのmicro:bitとscratchを連携させたスーパーマリオのようなゲームや、6年生のニンジャのブロック崩しなど、何度もプレイしたくなる魅力的な作品でした。その他の作品も、各ニンジャの個性がしっかり反映されており、見ている人たちを楽しませてくれました。 全体を通してそれぞれのニンジャが自分の作りたい作品イメージに向かって思考錯誤しながら完成に近づいていく様子が多く見られました。発表時は、相手に自分の作品を一生懸命伝えようとしている姿が印象的でした。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/02/27/2022-02-27%20%E7%AC%AC%EF%BC%93%EF%BC%93%E5%9B%9E/"},{"title":"第３７回開催レポート　2022/04/24","text":"4月24日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、チャンピオンが集まりCoderDojo大府第37回を開催しました。 開催風景scrath、toioの作品制作に取り組みました。 作品発表scratch &amp; toio scratch作品の発表はスマブラのような格闘ゲームや、続きが気になる物語等、個性的で面白い作品ばかりでした。toioではパソコンを使用せず、命令カードを読み込ませてキューブを動かす作品を発表しました。 全体を通して作品製作や発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/04/26/2022-04-24%20%E7%AC%AC%EF%BC%93%EF%BC%97%E5%9B%9E/"},{"title":"第３８回開催レポート　2022/05/01","text":"5月1日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオンが集まりCoderDojo大府第38回を開催しました。 開催風景scrath、toio、LEGO Boost、Makecode Arcadeの作品制作に取り組みました。 作品発表scratch マリオのように敵を倒したり落とし穴を回避しながら前に進んでいくゲームやタイミングに合わせてクリックする音楽ゲームなど、本当に楽しめる作品でした。 LEGO Boost LEGOの猫を組み立ててところまで発表しました。完成が楽しみです。 toio 命令カードを読み込ませてキューブを動かす作品を発表しました。また、LEGO人形がUSAの曲に合わせて踊る美しい作品を披露してくれました。 Makecode Arcade Coder Dojo大府で初めてとなるMakecode Arcadeによる発表です。脱出ゲームを仕上げてくれました。 全体を通してMakecode Arcade、LEGO Boost、toio等、作品の種類も豊富で見応えのある作品ばかりでした。作品製作や発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,800円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/05/07/2022-05-01%20%E7%AC%AC%EF%BC%93%EF%BC%98%E5%9B%9E/"},{"title":"第４１回開催レポート　2022/07/17","text":"7月17日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、チャンピオンが集まりCoderDojo大府第41回を開催しました。 チャンピオン発表機会学習をお手軽に体験できる「Teachable machine」と「scratch」を連携し、Webカメラの前を通過した人物を認識し「○○ちゃん、おかえりー」と声をかけてくれる作品を発表しました。人物が正しく判別できるか不安でしたが、ばっちり判別成功し一安心しました。 作品発表scratch 初参加の年長の女の子が、花を描いてくれる猫や、虹がウェーブ状に動作する作品を発表しました。この調子で、どんどん色々な作品制作に取り組んでもらえたら嬉しいですね。他のニンジャは、選んだ車を運転できる作品や、モンストロの物語を表現した作品等、独自性のある面白い作品で盛り上がりました。 Minecraft 初参加の中学１年生のニンジャが、ロケットの建造物が宇宙に打ち上げられるようプログラムされた作品を発表しました。マイクラのプログラムで、こんな凄いことが出来るのか！という衝撃的な作品でした。 micro:bit LEDランプに平仮名・カタカナを表示する、音がなる名刺を発表しました。micro:bitの25個のLEDランプで平仮名・カタカナを表現するのは難しいのですが、上手く表現されていました。 全体を通して今回はMinecraftのプログラミングの奥深さを知ることが出来た回でした。本当に刺激的な作品でしたので私も含めMinecraftをやっているニンジャたちは、同様のプログラムに挑戦したくなったのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/07/18/2022-07-17%20%E7%AC%AC%EF%BC%94%EF%BC%91%E5%9B%9E/"},{"title":"第４２回開催レポート　2022/07/31","text":"7月31日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)5人、チャンピオンが集まりCoderDojo大府第42回を開催しました。 開催風景scrath、micro:bit、Minecraftの作品制作に取り組みました。 作品発表scratch お掃除ロボのルンバを再現した作品や、野球のバッティングゲーム等、様々な作品を披露しました。バッティングゲームはみんなでワイワイ楽しんでしまいました。 micro:bit micro:bitを音声認識や揺らすといった動作で、メロディやLEDランプを制御する作品です。プログラミングコードも分かりやすく説明してもらいました。 Minecraft 自然の地形を利用して作成された家や、レバーを操作することで隠し扉が開く基地を披露しました。隠し扉を制御するレッドストーンの仕組みも説明してもらいました。 全体を通して今回は参加者が比較的少なかったため各発表作品をみんなで遊んだり、プログラムの仕組みを細かく説明してもらったり、まったり楽しむことが出来ました。制作時間では子供達同士で教えあう光景が多く見られたのが非常に良かったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は1,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/08/04/2022-07-31%20%E7%AC%AC%EF%BC%94%EF%BC%92%E5%9B%9E/"},{"title":"第３９回開催レポート　2022/05/15","text":"5月15日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)11人、メンター1人、チャンピオンが集まりCoderDojo大府第39回を開催しました。 開催風景scrath、toio、Makecode Arcadeの作品制作に取り組みました。 作品発表scratch お絵かきをAIが採点するゲームや、マリオのように敵を倒したり落とし穴を回避しながら前に進んでいくゲームなど非常に盛り上がりました。 toio 命令カードを読み込ませてキューブを動かす作品を発表しました。条件式の命令カードもあり、なかなかやりがいがあります。 Makecode Arcade 本格的な2Dアクションゲームでした。音も画面も昔のファミコンをプレイしている感じですね。 全体を通して作った作品を他の人にプレイしてもらう等していたら、盛り上がりすぎて発表で確保していた予定時間を大きく超過してしまいました。けど、楽しかったです。作品製作や発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/05/19/2022-05-15%20%E7%AC%AC%EF%BC%93%EF%BC%99%E5%9B%9E/"},{"title":"第４５回開催レポート　2022/09/18","text":"9月18日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオンが集まりCoderDojo大府第45回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表scratch ポケモンのゲッコウガが分身する物語や、ゾンビを倒すアクションゲーム、ブロック崩しゲームを発表しました。みんな楽しそうに発表していたのが印象的です。 Minecraft レッドストーンを活用した隠し通路、古代遺跡、スケート場、そして最後はフォールガイズというゲームを再現した障害物競走のステージを発表しました。障害物競走は、みんなでプレイして大盛りあがりでした。 全体を通して制作時間は、各ニンジャが作りたい作品をしっかりイメージ出来ていることもあり、テンポよく作品制作が進んでいた印象です。発表はscratchもマイクラも各自のこだわりがしっかり表現出来ていて、見ごたえのある発表ばかりで、保護者の方も楽しめたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/09/19/2022-09-18%20%E7%AC%AC%EF%BC%94%EF%BC%95%E5%9B%9E/"},{"title":"第４０回開催レポート　2022/06/26","text":"6月26日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、チャンピオンが集まりCoderDojo大府第40回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表scratch 都道府県のパズルピースを「50音順」に地図に当てはめていく作品や、独自に考えられた物語の作品など本当に楽しめる作品ばかりでした。 Minecraft アスレチックや打合げ花火、牛が大量の牛小屋などユニークな作品を発表してもらいました。 全体を通して久しぶりの開催で作品がアップロードできない等のトラブルも発生しましたが、みんなの協力もあって全ての作品発表を無事終えることができました。作品製作や発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/06/28/2022-06-26%20%E7%AC%AC%EF%BC%94%EF%BC%90%E5%9B%9E/"},{"title":"第４４回開催レポート　2022/08/28","text":"8月28日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)10人、メンター1人、チャンピオンが集まりCoderDojo大府第44回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表scratch ボールが人から逃げるゲームや、画面上の玉をパクパク食べるゲーム、ボタン連打で走る競争や、自動でパズルを生成するゲームを発表しました。どの作品も個性的で面白く、非常に見応えがありました Minecraft レッドストーンを活用した的あてゲームや、おしゃれな建築、化学実験による風船や花火の作成等、大人も驚くような作品がてんこもりでした。 全体を通して作品制作の時間では、ニンジャ達が互いに教え合う光景が多く見られました。発表は、みんな自信を持って自分の作品説明が出来ており、質問も活発に飛び交い賑やかに進行できました。。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,450円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/09/02/2022-08-28%20%E7%AC%AC%EF%BC%94%EF%BC%94%E5%9B%9E/"},{"title":"第４３回開催レポート　2022/08/14","text":"8月14日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、チャンピオンが集まりCoderDojo大府第43回を開催しました。 開催風景scrath、toioの作品制作に取り組みました。 作品発表scratch 年長さんや３年生のニンジャが、テニス、クイズ、プッシュポップ、パックマンと工夫が詰まったゲームを披露しました。 toio １年生ニンジャ２人によるtoio発表です。初めて発表体験のニンジャも堂々とみんなの前で説明出来ていました。 全体を通してそれぞれのニンジャが集中して自分の作品制作に取り組んでいる姿が多く見られました。参加してくれた保護者の方もニンジャ達と一緒に問題解決を楽しんで頂けたのではないかと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は1,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/08/17/2022-08-14%20%E7%AC%AC%EF%BC%94%EF%BC%93%E5%9B%9E/"},{"title":"第４６回開催レポート　2022/10/09","text":"10月9日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)10人、メンター4人、チャンピオンが集まりCoderDojo大府第46回を開催しました。 開催風景scrath、Minecraft、toioの作品制作に取り組みました。 作品発表toio メンターによる「DA PUMP」のUSAの歌に合わせてtoioがダンスする作品です。リズムもばっちりあっておりニンジャたちも大興奮でした。 scratch 迷路をランダム生成して実際に迷路が楽しめるゲーム、ポケモンのゲッコウガの攻撃をかわすゲーム、Music Player、猫がジャンプしながら障害物をかわすゲームを発表しました。作品それぞれにニンジャの個性が詰め込まれており、みんなで楽しめました。 Minecraft おしゃれな家、空港、水族館、モダンハウス、フォールガイズの2ndステージ、ロケット打ち上げ失敗（わざと）の作品を発表しました。それぞれ工夫したところをわかりやすく説明してくれて、見応えがありました。 全体を通してMinecraftもScratchもニンジャ達が楽しんで作品製作に取り組んでいました。発表ではニンジャの質問や感想が活発に行われており、見ている大人達も大変勉強になり楽しかったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,400円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/10/16/2022-10-09%20%E7%AC%AC%EF%BC%94%EF%BC%96%E5%9B%9E/"},{"title":"第４７回開催レポート　2022/10/23","text":"10月23日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)7人、メンター2人、チャンピオンが集まりCoderDojo大府第47回を開催しました。 開催風景scrath、Minecraft、hack for playの作品制作に取り組みました。 作品発表Minecraft ピアノ、洞窟迷路、空港レストラン、ピラミッド型遺跡の作品を発表しました。それぞれの作品にいろんな仕掛けが用意されていて面白かったです。 scratch 太鼓の達人、カメラ画像認識によるクイズの作品を発表しました。どちらもプログラム難易度が高い作品でしたが、みんなで楽しめるゲームに仕上げてくれました。 hack for play 簡単なテキストプログラミングでゲーム作成ができるhack for playを紹介してくれました。みんな興味津々で聞いていました。 全体を通して和気あいあいと作品制作、発表を楽しむことができました。各ニンジャがプログラミングを楽しんでいる姿を見ると、こちらも嬉しくなりますね。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/10/24/2022-10-23%20%E7%AC%AC%EF%BC%94%EF%BC%97%E5%9B%9E/"},{"title":"第５３回開催レポート　2023/02/26","text":"2月26日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)11人、チャンピオンが集まりCoderDojo大府第53回を開催しました。 作品発表Scratch うさぎを操作して玉をよけるシューティングゲーム、分裂するレモンをレーザーで壊し続ける爽快なシューティングゲーム、ひよこを操作してピヨピヨ鳴かせる作品、猫をジャンプさせて玉をよけるゲーム、設定が面白いアニメーション作品を発表しました。 Scratch &amp; micro:bit micro:bitを傾けて左右に操作するブロックくずしを発表しました。 Minecraft 草原を馬で散策する作品、アスレチック、ポケモンの拡張機能を利用した作品、核爆発する作品、エンダードラゴンをペットにする作品を発表しました。 全体を通してマイクラもScratchもニンジャ達が楽しんで作品作りに取り組んでいました。発表も賑やかに進行し、保護者の方も楽しんで頂けたのではと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,300円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/02/27/2023-02-26%20%E7%AC%AC%EF%BC%95%EF%BC%93%E5%9B%9E/"},{"title":"第４９回開催レポート　2022/11/27","text":"11月27日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、チャンピオンが集まりCoderDojo大府第49回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表scratch 壁にぶつからず駐車するゲーム、自作のきらきら星メロディ、りんごキャッチゲーム、落とし穴や罠をかわしながら進んでいくゲーム、星を撃ち落とすゲームを発表しました。作品としての完成度が高く、やってみたくなる魅力的な作品ばかりでした。 Minecraft ガチャガチャやスマホの建築、ゾンビとの対決場、ポケモンのリオルの家の作品を発表しました。個性的な作品ばかりで楽しめました。 全体を通して初参加のニンジャが、時間内に作品を完成できて、満足そうに発表できていた姿が印象的でした。保護者の方にはCoderDojoのゆるーい雰囲気を気に入ってもらえたようで、もっと早く（CoderDojo）知りたかったと言ってもらえたことは嬉しかったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/12/02/2022-11-27%20%E7%AC%AC%EF%BC%94%EF%BC%99%E5%9B%9E/"},{"title":"第４８回開催レポート　2022/11/06","text":"11月06日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)4人、チャンピオンが集まりCoderDojo大府第48回を開催しました。 作品発表Minecraft ポケモンのリザードン、野菜・フルーツ、迷路の作品を発表しました。迷路では、みんなでタイムアタックで競争して遊びました。 scratch 初参加のニンジャが、ねずみが猫から逃げるゲームを発表しました。作品制作のコツを理解したとのことですので、どんどん新しい作品制作に挑戦してもらいたいです。 全体を通して作品制作では、みんなに楽しんでもらえるような作品を意識して取り組んでいる姿が印象的でした。他人に自分の作品・ゲームをさわってもらうのは、お互い楽しめて良いですね。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/11/14/2022-11-06%20%E7%AC%AC%EF%BC%94%EF%BC%98%E5%9B%9E/"},{"title":"第５０回開催レポート　2022/12/11","text":"12月11日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、チャンピオンが集まりCoderDojo大府第50回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表scratch 壁にぶつからず駐車するゲーム、エアーホッケー、ムジカピッコリーノの物語、レーダーを操作して猫を探すゲームを発表しました。駐車するゲームやエアーホッケーは、みんなでプレイしてめちゃめちゃ盛り上がりました。 Minecraft 仕掛け盛りだくさんの戦う巨大ロボット、コマンドブロックでスタートとゴールを表示させるスケート場、脱獄＆海賊船の作品を発表しました。どの作品も、みんなで楽しめる工夫がされており、非常に楽しめました。 全体を通して発表ではすべてのニンジャが積極的に質問してくれたおかげで、とても盛り上がりました。また、他の人にプレイしてもらうための作品制作をしているニンジャが多く、誰がプレイするかを選ぶための、じゃんけん大会が頻発してワイワイしてました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2022/12/13/2022-12-11%20%E7%AC%AC%EF%BC%95%EF%BC%90%E5%9B%9E/"},{"title":"第５４回開催レポート　2023/03/12","text":"3月12日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、メンター2人、チャンピオンが集まりCoderDojo大府第54回を開催しました。 開催風景ビスケット、scrath、Minecraftの作品制作に取り組みました。 作品発表ビスケット 年長さんの女の子が自分で描いたかわいい動物が動く作品を披露しました。 Scratch 迷路、戦艦大和の対戦ゲーム、ひよこがジャンプしてドーナツをかわすゲーム、猫が手榴弾を持って戦うアニメーション作品を発表しました。 Minecraft 自動でクルクル回る床、仕掛け盛りだくさんのアスレチック、高床式倉庫、空に浮かぶ神秘的な建築物を発表しました。 全体を通してScratchもMinecraftもみんなで楽しめるような作品が多く、発表が大変盛り上がりました。子供達の質問と回答のやりとりも、楽しめたのではないかと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/03/19/2023-03-12%20%E7%AC%AC%EF%BC%95%EF%BC%94%E5%9B%9E/"},{"title":"第５２回開催レポート　2023/01/22","text":"1月22日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)5人、メンター1人、チャンピオンが集まりCoderDojo大府第52回を開催しました。 開催風景scrath、micro:bit、Minecraftの作品制作に取り組みました。 作品発表クローン500個（メンター作品） TurboWarpというscratch拡張サービスを使用して、scratchのクローン上限値の300個を解除した作品を紹介してもらいました。弾幕シューティングゲーム作成時に活用できそうです。 Scratch 跳ね返る玉を下に落とさないようにするピンポンゲーム、伊達政宗が敵と戦うアクションゲーム、線を描く機能を使用して多角形を作成する作品を発表しました。 Minecraft レッドストーンブロックと粘着ピストンで巨大なレッドストーン回路を作成しランプを点灯させる作品、遊園地の作品を発表しました。 micro:bit ボタンを押したら文字を表示させたり、かえるの歌を流す作品を発表しました。 全体を通して各作品にニンジャ達独自の工夫が詰め込まれており、見ていた側も楽しめたのではと思います。ニンジャ達が楽しそうに作品制作、発表に取り組んでくれていたようで安心しました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/01/23/2023-01-22%20%E7%AC%AC%EF%BC%95%EF%BC%92%E5%9B%9E/"},{"title":"第５６回開催レポート　2023/04/23","text":"4月23日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)13人、メンター1人、チャンピオンが集まりCoderDojo大府第56回を開催しました。また、CoderDojo大府初めてのオンラインの発表も実施しました。 作品発表biscuit 持参した「ぬいぐるみ」のイラストを作成及び動かす作品を発表しました。 Scratch 2Dのマリオのようなアクションゲーム、アルパカを宝箱を探すゲーム、ポケモンカードからポケモンが飛び出す怪奇現象、サメが恐竜から逃げるゲーム、画面状態に応じてポイント加算する作品、障害を避けながらゴールを目指すゲーム、ネズミを操作して猫から逃げるゲームを発表しました。 Minecraft 神殿、家具がおしゃれな家、夜のトロッコ、緊急脱出装置、ブロックで表現したカービィの作品を発表しました。 全体を通して初めてのオンライン開催でしたが、オンライン作品の発表も視聴でき、オンラインと現地間の質問のやりとりも出来て非常に良かったです。ニンジャ達が作品をみんなに見てもらうことをとても楽しみにしているのが伝わってきて、保護者の方も楽しめたのではないかと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/04/28/2023-04-23%20%E7%AC%AC%EF%BC%95%EF%BC%96%E5%9B%9E/"},{"title":"第５５回開催レポート　2023/03/19","text":"3月19日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)12人、メンター1人、チャンピオンが集まりCoderDojo大府第55回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表Scratch ちょうちょが花にふれると大きくなるゲーム、ひよこがジャンプしてドーナツをかわし星をとって回復するゲーム、車を駐車するゲーム、着せ替えゲーム、スロットゲーム、クラウド変数を使用したログインの仕組み作成、宮本武蔵が敵を倒していくゲーム作品を発表しました。 Minecraft 自動でクルクル回る床、住みやすそうな家、洋風のおしゃれな家、自動丸石製造機、破壊兵器の作品を発表しました。 全体を通して保護者が見守る中、みんな真剣な表情でパソコンを操作しながら作品制作に取り組んでいました。発表では、みんな自信を持って堂々と発表しており、保護者の方も楽しめたのではないかと思います。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/03/20/2023-03-19%20%E7%AC%AC%EF%BC%95%EF%BC%95%E5%9B%9E/"},{"title":"第５７回開催レポート　2023/04/30","text":"4月30日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人チャンピオンが集まりCoderDojo大府第57回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表Scratch 幾何学模様、恐竜を動かすゲーム、猫を操作して犬をかわすゲーム、ロケットのシューティングゲーム、地球に迫ってくる敵を攻撃するゲーム、小説のように作りこまれたアニメーション作品を発表しました。 Minecraft 影付きで美しい洋風の家、ガレージ付きのおしゃれな家、軍事基地の作品を発表しました。 全体を通して各作品にニンジャ達独自の工夫が詰め込まれており、見ていた側も楽しめたのではと思います。ニンジャ達が楽しそうに作品制作、発表に取り組んでくれていたようで安心しました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,100円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/04/30/2023-04-30%20%E7%AC%AC%EF%BC%95%EF%BC%97%E5%9B%9E/"},{"title":"第５８回開催レポート　2023/05/14","text":"5月14日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人、メンター3人、チャンピオンが集まりCoderDojo大府第58回を開催しました。 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表Scratch ４人同時プレイができる逃走中、ひよこがモンスターを倒すシューティングゲーム、迫りくるロボットを玉で撃ち落とすゲームを発表しました。 Minecraft 三種の神器が供えられている神殿、敵を一体倒すと周辺の敵も一斉に倒す仕組み（コマンドのプログラム）の紹介、動物捕獲装置の作品を発表しました。 全体を通してニンジャ達の作品をみんなでプレイしてワチャワチャ楽しめました。自分で作った作品を人に見てもらう、触ってもらうことを楽しんでいる姿が印象的でした。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/05/18/2023-05-14%20%E7%AC%AC%EF%BC%95%EF%BC%98%E5%9B%9E/"},{"title":"第５９回開催レポート　2023/05/28","text":"5月28日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター5人、チャンピオンが集まりCoderDojo大府第59回を開催しました。また、CoderDojo大府2回目のオンラインの発表も実施しました。 CoderDojo大府３周年記念シール 第１会の開催から、ずっとサポートしてくれていたメンターの方がCorderDojo大府３周年のシールを作成してくれました！！本当に感激です。次回の開催以降でも参加者に配布します！！ 開催風景scrath、Minecraftの作品制作に取り組みました。 作品発表### メンター発表 初めてのscratch作品制作とのことで、じゃんけんゲームを発表してもらいました。初作品で変数を使用しており、ニンジャから感心されておりました。 Scratch ジャンプして進むアクションゲーム、うさぎの散歩、地球が100個の星を描く作品、住んでる町のクイズ、色を変化させながらスプライト回す作品を発表しました。 Minecraft おしゃれな家、水車小屋、軍事基地の作品を発表しました。 全体を通してオンラインと現地の同時開催でしたがメンター陣のサポートが素晴らしく、みんなで楽しく遊べました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/06/04/2023-05-28%20%E7%AC%AC%EF%BC%95%EF%BC%99%E5%9B%9E/"},{"title":"第６０回開催レポート　2023/06/11","text":"6月11日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオンが集まりCoderDojo大府第60回を開催しました。 開催風景Scrath、Minecraft、toioの作品制作に取り組みました。 作品発表### メンター発表昔話第一幕 おじいさんがアイドルを目指すアニメーション作品です。続編が非常に気になる作品でした。 Scratch 電卓、迷路、もぐらたたきの作品を発表しました。 Minecraft 空島、コロシアム、的当て、水族館の作品を発表しました。 toio 不気味な目玉生物を罠にかける作品を発表しました。 全体を通して作品制作も発表も参加者みんなで楽しめました。他の人にゲーム作品をプレイしてもらったりメンター発表もあり大いに盛り上がりした。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/06/15/2023-06-11%20%E7%AC%AC%EF%BC%96%EF%BC%90%E5%9B%9E/"},{"title":"第６２回開催レポート　2023/07/16","text":"7月16日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)13人、メンター5人、チャンピオンが集まりCoderDojo大府第62回を開催しました。 開催風景Scratch、Minecraft、toioの作品制作に取り組みました。また、メンターの方がレゴEV3で制作したピンボールを披露してくれました。子供達に大人気でした。 作品発表メンター発表 メンターの方が、眼鏡をかけている／かけていないを画像認識できる作品を発表しました。google teachable machineとScratchを連携して、わずか数行のプログラムで仕上がったとのこと。 Scratch 横スクロールゲーム、ペンを複製・回転させてキレイな模様がかける作品、東京駅、エアホッケー、スライムを倒すゲーム、ジャンプゲームを発表しました。 Minecraft ニワトリ捕獲装置、乱闘、船、秘密基地、猫の家、駐屯基地の作品を発表しました。 toio はさみ型のキューブを操作して、紙を転がす動物のような作品を発表しました。 全体を通して参加者が多く、年齢層も幼稚園から中学２年生まで幅広かったですが、みんなで制作・発表を楽しむことが出来ました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は6,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/07/17/2023-07-16%20%E7%AC%AC%EF%BC%96%EF%BC%92%E5%9B%9E/"},{"title":"第６３回開催レポート　2023/07/30","text":"7月30日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター5人、チャンピオンが集まりCoderDojo大府第63回を開催しました。 開催風景Scratch、Minecraft、toioの作品制作に取り組みました。 作品発表メンター発表 メンターの２名の方に発表して頂きました。一人目は、javascriptを使用しリアルタイム動画をアルファベット文字型のモザイクで表現しており思わず「すごい」と声が出るような作品でした。二人目は、おじいさんがアイドルを目指す物語をscratchで制作してくれました。ニンジャ達のツボにハマったようで、とても盛り上がりました。 Scratch ４コマアニメ、ばけねこ退治、インベーダー、太鼓ゲーム、太鼓ゲーム改良版を発表しました。 Minecraft 桜の家、ボウガントルネードの作品を発表しました。 toio ２つのキューブを磁石に見立て、本物の磁石のようにくっついたり、離れたりする作品を発表しました。 全体を通してメンターの方の芸術作品や物語、ニンジャ達の工夫が詰まった面白い作品等、発表の時間に多くの笑いがあった楽しい会でした。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/07/30/2023-07-30%20%E7%AC%AC%EF%BC%96%EF%BC%93%E5%9B%9E/"},{"title":"第６１回開催レポート　2023/06/25","text":"6月25日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)9人(内オンライン2名)、メンター2人、チャンピオンが集まりCoderDojo大府第61回を開催しました。 同時開催中のCoderDojoをオンライン接続CoderDojo名護（沖縄県）さんからのお誘いで、CoderDojo八千代（千葉県）、CoderDojo瀬戸（愛知県）と会場をつないだDojo中継を実施しました。 開催風景Scrath、Minecraft、toioの作品制作に取り組みました。 作品発表Scratch ジャンプして進むアクションゲーム、かわいい猫の散歩、ビデオモーションを利用したもぐらたたき、ジャンプしてお菓子にたどり着くゲーム、沖縄方言変換機を発表しました。 Minecraft しかけの多い家、おしゃれな車に似合う洋風の家、ゆきだまマシンガンの作品を発表しました。 toio はさみ型のキューブを操作して、逃げるキューブを捕まえる作品を発表しました。 全体を通してニンジャ達の個性的な作品は、非常に見ごたえがあり、保護者の方も含めてみんなで楽しめました。ベトナムとの子供達と会場を繋いでの開催も双方でコミュケーションがとれており、上手くいっていそうで一安心です。Dojo中継では他のDojoの様子を知ることが出来てよかったです。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,900円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/06/27/2023-06-25%20%E7%AC%AC%EF%BC%96%EF%BC%91%E5%9B%9E/"},{"title":"第６５回開催レポート　2023/08/27","text":"8月27日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)8人、メンター2人、チャンピオン、オンラインで2人が集まりCoderDojo大府第65回を開催しました。 開催風景Scratch、Minecraftの作品制作に取り組みました。 作品発表Scratch ４コマ漫画、猫の冒険、おっかけっこ、ピンポン、ジャンピングゲーム、スノーボード、ビルを避けるゲームを発表しました。 Minecraft モンスターハウス、雷魔法、TNT10*10を発表しました。 全体を通してニンジャ達が集中して作成制作に取り組んでいる姿が印象的でした。発表では個性あふれるユニークな作品が多く、大人も楽しめました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は4,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/08/28/2023-08-27%20%E7%AC%AC%EF%BC%96%EF%BC%95%E5%9B%9E/"},{"title":"第６６回開催レポート　2023/09/10","text":"9月10日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)11人、メンター6人、チャンピオンが集まりCoderDojo大府第66回を開催しました。 開催風景Scratch、Minecraft、toioの作品制作に取り組みました。 作品発表Scratch かわいいゴキブリ、ボールタッチゲーム、がっちゃの宝探し、みんなの歩数、ライントレーサー、モンスターシューティング、キャッチフルーツ、鳥人間コンテストを発表しました。 Minecraft 障害物競争（Fall Guys再現）、武器格納庫を発表しました。 toio 盆踊りしているtoioを操作して阿修羅を怒らせる作品を発表しました。 全体を通して作品のクオリティが高く、大人でも唸ってしまうような作品が多く非常に楽しめました。発表時の質問も多く、各自工夫したところを皆にしっかり伝えられていました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は5,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/09/10/2023-09-10%20%E7%AC%AC%EF%BC%96%EF%BC%96%E5%9B%9E/"},{"title":"第５１回開催レポート　2023/01/08","text":"1月8日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)6人、メンター1人、チャンピオンが集まりCoderDojo大府第51回を開催しました。 開催風景scrath、micro:bit、Minecraft、Geometry Dashの作品制作に取り組みました。 作品発表scratch &amp; micro:bit micro:bitを傾けて前後左右に進ことができる3D迷路、micro:bitをふっておみくじ、果物探しゲームを発表しました。 Minecraft 的当てによるおみくじ、おしゃれな家の作品を発表しました。 Geometry Dash Steamsのゲームで、スーパーマリオのような横スクロールゲームが作成できるソフトの紹介です。実際に作成したステージをみんなにプレイしてもらい楽しみました。 全体を通して発表では他の人にプレイしてもらうための作品が多く、みんなで楽しむことが出来ました。初参加のニンジャ２名も、制作時間内にバッチリ仕上げてくれて、堂々とわかりやすく発表しれくれました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/01/08/2023-01-08%20%E7%AC%AC%EF%BC%95%EF%BC%91%E5%9B%9E/"},{"title":"第６７回開催レポート　2023/09/24","text":"9月24日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)4人、メンター4人、チャンピオンが集まりCoderDojo大府第67回を開催しました。 開催風景Scratch、Minecraft、toioの作品制作に取り組みました。 作品発表メンター発表 桃から生まれたスモーマンがアイドルを目指す作品、ブロック崩し風に蜘蛛を倒すゲームを発表しました。 Scratch 魚釣りゲームを発表しました。 Minecraft レゴロボットをマイクラで再現、水族館を発表しました。 toio 追っかけてくる虫から逃げるゲームを発表しました。 全体を通して発表ではニンジャが作成したゲームで点数を競って盛り上がりました。いずれの作品も個性的で楽しめました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,000円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/09/24/2023-09-24%20%E7%AC%AC%EF%BC%96%EF%BC%97%E5%9B%9E/"},{"title":"第６８回開催レポート　2023/10/08","text":"10月8日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)5人、メンター3人、チャンピオンが集まりCoderDojo大府第68回を開催しました。 開催風景Scratch、Minecraftの作品制作に取り組みました。 作品発表Scratch オンラインチャット、ボールをクリックするゲームを発表しました。 Minecraft 敵を殲滅するトラップ、隠し地下のある家を発表しました。 全体を通して作品制作中の質問も多く発生しましたが私含め各メンターの方がニンジャ達と一緒に考えて進めることが出来ました。発表作品も個性的な作品が多く楽しめました。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は2,500円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/10/08/2023-10-08%20%E7%AC%AC%EF%BC%96%EF%BC%98%E5%9B%9E/"},{"title":"第６４回開催レポート　2023/08/13","text":"8月13日(9:30～11:30) おおぶ文化交流の杜 allobuで、ニンジャ(子供)10人、メンター3人、チャンピオンが集まりCoderDojo大府第64回を開催しました。 開催風景Scratch、Minecraft、toioの作品制作に取り組みました。 作品発表メンター発表 ２人プレイ用の〇×ゲームを発表しました。２組の勝負を実施してもらい、引き分けが連発するかと思いきや、２組とも決着がついて面白かったです。 Scratch バナナを食べる熊、マウスで向かってくる敵を倒すゲーム、玉撃ちゲーム、東浦クイズ、猫逃げ改良版、キッチンタイマーを発表しました。 Minecraft 3*3の隠し扉、ガストの気球、トラップタワーを発表しました。 toio イカの動きを再現する作品を発表しました。 全体を通してメンターによるみんなで遊べる作品、ニンジャ達の個性あふれるユニークな作品で発表が賑やかでした。またCoderDojo大府では開催の運営をお手伝していただけるメンターを募集中です。プログラミングのスキルがなくても、ニンジャ達と一緒に考えて、一緒に楽しんでもらえれば大丈夫ですので、一緒にやってみようかなと思いましたら、会場で私（河田 修）に声をかけて頂けると幸いです。 寄付について今回いただいた寄付は3,700円でした。 いただいた寄付金は会場費、備品購入費に充てさせていただきました。 収支表 今後の予定今後の予定は下記のサイトをご確認ください。参加予約(connpass)","link":"/2023/08/14/2023-08-13%20%E7%AC%AC%EF%BC%96%EF%BC%94%E5%9B%9E/"}],"tags":[],"categories":[]}